MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i3c.h
/**
  ******************************************************************************
  * @file    stm32c5xx_ll_i3c.h
  * @brief   Header file of I3C LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5xx_LL_I3C_H
#define STM32C5xx_LL_I3C_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */

#if defined (I3C1)

/** @defgroup I3C_LL I3C
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup I3C_LL_Exported_Constants LL I3C Constants
  * @{
  */

/** @defgroup I3C_LL_EC_GET_FLAG Get flags defines
  * @brief    Flags defines which can be used with LL_I3C_READ_REG function
  * @{
  */
#define LL_I3C_EVR_CFEF        I3C_EVR_CFEF
#define LL_I3C_EVR_TXFEF       I3C_EVR_TXFEF
#define LL_I3C_EVR_CFNFF       I3C_EVR_CFNFF
#define LL_I3C_EVR_SFNEF       I3C_EVR_SFNEF
#define LL_I3C_EVR_TXFNFF      I3C_EVR_TXFNFF
#define LL_I3C_EVR_RXFNEF      I3C_EVR_RXFNEF
#define LL_I3C_EVR_RXLASTF     I3C_EVR_RXLASTF
#define LL_I3C_EVR_TXLASTF     I3C_EVR_TXLASTF
#define LL_I3C_EVR_FCF         I3C_EVR_FCF
#define LL_I3C_EVR_RXTGTENDF   I3C_EVR_RXTGTENDF
#define LL_I3C_EVR_ERRF        I3C_EVR_ERRF
#define LL_I3C_EVR_IBIF        I3C_EVR_IBIF
#define LL_I3C_EVR_IBIENDF     I3C_EVR_IBIENDF
#define LL_I3C_EVR_CRF         I3C_EVR_CRF
#define LL_I3C_EVR_CRUPDF      I3C_EVR_CRUPDF
#define LL_I3C_EVR_HJF         I3C_EVR_HJF
#define LL_I3C_EVR_WKPF        I3C_EVR_WKPF
#define LL_I3C_EVR_GETF        I3C_EVR_GETF
#define LL_I3C_EVR_STAF        I3C_EVR_STAF
#define LL_I3C_EVR_DAUPDF      I3C_EVR_DAUPDF
#define LL_I3C_EVR_MWLUPDF     I3C_EVR_MWLUPDF
#define LL_I3C_EVR_MRLUPDF     I3C_EVR_MRLUPDF
#define LL_I3C_EVR_RSTF        I3C_EVR_RSTF
#define LL_I3C_EVR_ASUPDF      I3C_EVR_ASUPDF
#define LL_I3C_EVR_INTUPDF     I3C_EVR_INTUPDF
#define LL_I3C_EVR_DEFF        I3C_EVR_DEFF
#define LL_I3C_EVR_GRPF        I3C_EVR_GRPF
#define LL_I3C_SER_PERR        I3C_SER_PERR
#define LL_I3C_SER_STALL       I3C_SER_STALL
#define LL_I3C_SER_DOVR        I3C_SER_DOVR
#define LL_I3C_SER_COVR        I3C_SER_COVR
#define LL_I3C_SER_ANACK       I3C_SER_ANACK
#define LL_I3C_SER_DNACK       I3C_SER_DNACK
#define LL_I3C_SER_DERR        I3C_SER_DERR
/**
  * @}
  */

/** @defgroup I3C_LL_EC_IT IT Defines
  * @brief    IT defines and combinations of defines
  * @{
  */
#define LL_I3C_IER_CFNFIE       I3C_IER_CFNFIE
#define LL_I3C_IER_SFNEIE       I3C_IER_SFNEIE
#define LL_I3C_IER_TXFNFIE      I3C_IER_TXFNFIE
#define LL_I3C_IER_RXFNEIE      I3C_IER_RXFNEIE
#define LL_I3C_IER_FCIE         I3C_IER_FCIE
#define LL_I3C_IER_RXTGTENDIE   I3C_IER_RXTGTENDIE
#define LL_I3C_IER_ERRIE        I3C_IER_ERRIE
#define LL_I3C_IER_IBIIE        I3C_IER_IBIIE
#define LL_I3C_IER_IBIENDIE     I3C_IER_IBIENDIE
#define LL_I3C_IER_CRIE         I3C_IER_CRIE
#define LL_I3C_IER_CRUPDIE      I3C_IER_CRUPDIE
#define LL_I3C_IER_HJIE         I3C_IER_HJIE
#define LL_I3C_IER_WKPIE        I3C_IER_WKPIE
#define LL_I3C_IER_GETIE        I3C_IER_GETIE
#define LL_I3C_IER_STAIE        I3C_IER_STAIE
#define LL_I3C_IER_DAUPDIE      I3C_IER_DAUPDIE
#define LL_I3C_IER_MWLUPDIE     I3C_IER_MWLUPDIE
#define LL_I3C_IER_MRLUPDIE     I3C_IER_MRLUPDIE
#define LL_I3C_IER_RSTIE        I3C_IER_RSTIE
#define LL_I3C_IER_ASUPDIE      I3C_IER_ASUPDIE
#define LL_I3C_IER_INTUPDIE     I3C_IER_INTUPDIE
#define LL_I3C_IER_DEFIE        I3C_IER_DEFIE
#define LL_I3C_IER_GRPIE        I3C_IER_GRPIE
#define LL_I3C_CTRL_TX_IT       (I3C_IER_FCIE | I3C_IER_CFNFIE | I3C_IER_TXFNFIE | I3C_IER_ERRIE) /* Ctrl TX IT */
#define LL_I3C_CTRL_RX_IT       (I3C_IER_FCIE | I3C_IER_CFNFIE | I3C_IER_RXFNEIE | I3C_IER_ERRIE) /* Ctrl RX IT */
#define LL_I3C_CTRL_DAA_IT      (I3C_IER_FCIE | I3C_IER_CFNFIE | I3C_IER_TXFNFIE | I3C_IER_ERRIE) /* Ctrl DAA  IT */
#define LL_I3C_TGT_TX_IT        (I3C_IER_FCIE | I3C_IER_TXFNFIE | I3C_IER_ERRIE) /*!< Tgt TX IT  */
#define LL_I3C_TGT_RX_IT        (I3C_IER_FCIE | I3C_IER_RXFNEIE | I3C_IER_ERRIE)  /*!< Tgt RX IT  */
#define LL_I3C_TGT_CTRLROLE_IT  (I3C_IER_CRUPDIE | I3C_IER_ERRIE)  /*!< Tgt Controller-Role IT */
#define LL_I3C_TGT_HOTJOIN_IT   (I3C_IER_DAUPDIE | I3C_IER_ERRIE)  /*!< Tgt Hot-Join IT */
#define LL_I3C_TGT_IBI_IT       (I3C_IER_IBIENDIE | I3C_IER_ERRIE)  /*!< Tgt IBI IT */
#define LL_I3C_XFER_DMA         (I3C_IER_FCIE | I3C_IER_ERRIE)  /*!< Tgt or Ctrl DMA IT */
#define LL_I3C_IER_ALL          0xFFFFFFFFU  /*!< All */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_MASK_IT MASKS IT Defines
  * @brief    Masks interrupt defines which can be used with LL_I3C_READ_REG and LL_I3C_WRITE_REG functions
  * @{
  */
#define LL_I3C_MISR_CFNFMIS       I3C_MISR_CFNFMIS
#define LL_I3C_MISR_SFNEMIS       I3C_MISR_SFNEMIS
#define LL_I3C_MISR_TXFNFMIS      I3C_MISR_TXFNFMIS
#define LL_I3C_MISR_RXFNEMIS      I3C_MISR_RXFNEMIS
#define LL_I3C_MISR_FCMIS         I3C_MISR_FCMIS
#define LL_I3C_MISR_RXTGTENDMIS   I3C_MISR_RXTGTENDMIS
#define LL_I3C_MISR_ERRMIS        I3C_MISR_ERRMIS
#define LL_I3C_MISR_IBIMIS        I3C_MISR_IBIMIS
#define LL_I3C_MISR_IBIENDMIS     I3C_MISR_IBIENDMIS
#define LL_I3C_MISR_CRMIS         I3C_MISR_CRMIS
#define LL_I3C_MISR_CRUPDMIS      I3C_MISR_CRUPDMIS
#define LL_I3C_MISR_HJMIS         I3C_MISR_HJMIS
#define LL_I3C_MISR_WKPMIS        I3C_MISR_WKPMIS
#define LL_I3C_MISR_GETMIS        I3C_MISR_GETMIS
#define LL_I3C_MISR_STAMIS        I3C_MISR_STAMIS
#define LL_I3C_MISR_DAUPDMIS      I3C_MISR_DAUPDMIS
#define LL_I3C_MISR_MWLUPDMIS     I3C_MISR_MWLUPDMIS
#define LL_I3C_MISR_MRLUPDMIS     I3C_MISR_MRLUPDMIS
#define LL_I3C_MISR_RSTMIS        I3C_MISR_RSTMIS
#define LL_I3C_MISR_ASUPDMIS      I3C_MISR_ASUPDMIS
#define LL_I3C_MISR_INTUPDMIS     I3C_MISR_INTUPDMIS
#define LL_I3C_MISR_DEFMIS        I3C_MISR_DEFMIS
#define LL_I3C_MISR_GRPMIS        I3C_MISR_GRPMIS
/**
  * @}
  */

