MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i3c.h
/** @defgroup I3C_LL_EC_MODE MODE
  * @{
  */
#define LL_I3C_MODE_CONTROLLER   I3C_CFGR_CRINIT  /*!< I3C controller mode */
#define LL_I3C_MODE_TARGET       0x00000000U      /*!< I3C target (controller capable) mode */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_DMA_REG_DATA DMA Register data
  * @{
  */
#define LL_I3C_DMA_REG_DATA_TRANSMIT_BYTE  0x0U  /*!< Get addr of data register used for transmission in byte */
#define LL_I3C_DMA_REG_DATA_RECEIVE_BYTE   0x1U  /*!< Get addr of data register used for reception in byte */
#define LL_I3C_DMA_REG_DATA_TRANSMIT_WORD  0x2U  /*!< Get addr of data register used for transmission in Word */
#define LL_I3C_DMA_REG_DATA_RECEIVE_WORD   0x3U  /*!< Get addr of data register used for reception in Word */
#define LL_I3C_DMA_REG_STATUS              0x4U  /*!< Get addr of status register used for transfer status in Word */
#define LL_I3C_DMA_REG_CONTROL             0x5U  /*!< Get addr of control register used for transfer control in Word */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_RX_THRESHOLD Rx threshold
  * @{
  */
#define LL_I3C_RXFIFO_THRESHOLD_1_8   0x00000000U      /*!< Rx FIFO threshold is 1 byte in a FIFO depth of 8 bytes */
#define LL_I3C_RXFIFO_THRESHOLD_1_2   I3C_CFGR_RXTHRES /*!< Rx FIFO threshold is 1 word in a FIFO depth of 2 word */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_TX_THRESHOLD Tx threshold
  * @{
  */
#define LL_I3C_TXFIFO_THRESHOLD_1_8   0x00000000U      /*!< Tx FIFO threshold is 1 byte in a FIFO depth of 8 bytes */
#define LL_I3C_TXFIFO_THRESHOLD_1_2   I3C_CFGR_TXTHRES /*!< Tx FIFO threshold is 1 word in a FIFO depth of 2 words */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_CTRL_FIFO_CONFIG Controller fifo configuration
  * @{
  */
#define LL_I3C_CTRL_FIFO_NONE         0                                 /*!< Control and status FIFO disable */
#define LL_I3C_CTRL_FIFO_CONTROL_ONLY I3C_CFGR_TMODE                    /*!< Control FIFO enable */
#define LL_I3C_CTRL_FIFO_STATUS_ONLY  I3C_CFGR_SMODE                    /*!< Status FIFO enable */
#define LL_I3C_CTRL_FIFO_ALL          (I3C_CFGR_SMODE | I3C_CFGR_TMODE) /*!< Control and status FIFO enable */


/** @defgroup I3C_LL_EC_End_Of_FrameCompletion End of frame completion
  * @{
  */
#define LL_I3C_END_OF_FRAME_CPLT_DISABLE  I3C_CFGR_FCFDIS /*!< Frame complete flag is clear by HW */
#define LL_I3C_END_OF_FRAME_CPLT_ENABLE   0x00000000U /*!< Frame complete flag must be clear by SW (default config) */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_PAYLOAD Payload
  * @{
  */
#define LL_I3C_PAYLOAD_EMPTY   0x00000000U  /*!< Empty payload, no additional data after IBI ack */
#define LL_I3C_PAYLOAD_1_BYTE  I3C_MAXRLR_IBIP_0                        /*!< 1 additional data byte after IBI ack */
#define LL_I3C_PAYLOAD_2_BYTE  I3C_MAXRLR_IBIP_1                        /*!< 2 additional data bytes after IBI ack */
#define LL_I3C_PAYLOAD_3_BYTE  (I3C_MAXRLR_IBIP_1 | I3C_MAXRLR_IBIP_0)  /*!< 3 additional data bytes after IBI ack */
#define LL_I3C_PAYLOAD_4_BYTE  I3C_MAXRLR_IBIP_2                        /*!< 4 additional data bytes after IBI ack */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_SDA_HOLD_TIME SDA HOLD TIME 0
  * @{
  */
#define LL_I3C_SDA_HOLD_TIME_0_5  0x00000000U                                     /*!< SDA hold time is 0.5 x ti3cclk */
#define LL_I3C_SDA_HOLD_TIME_1_5  I3C_TIMINGR1_SDA_HD_0                           /*!< SDA hold time is 1.5 x ti3cclk */
#define LL_I3C_SDA_HOLD_TIME_2_5  I3C_TIMINGR1_SDA_HD_1                           /*!< SDA hold time is 2.5 x ti3cclk */
#define LL_I3C_SDA_HOLD_TIME_3_5  (I3C_TIMINGR1_SDA_HD_1 | I3C_TIMINGR1_SDA_HD_0) /*!< SDA hold time is 3.5 x ti3cclk */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_OWN_ACTIVITY_STATE Own activity state
  * @{
  */
#define LL_I3C_OWN_ACTIVITY_STATE_0  0x00000000U                                   /*!< Own ctrl activity state 0 */
#define LL_I3C_OWN_ACTIVITY_STATE_1  I3C_TIMINGR1_ASNCR_0                          /*!< Own ctrl activity state 1 */
#define LL_I3C_OWN_ACTIVITY_STATE_2  I3C_TIMINGR1_ASNCR_1                          /*!< Own ctrl activity state 2 */
#define LL_I3C_OWN_ACTIVITY_STATE_3  (I3C_TIMINGR1_ASNCR_1 | I3C_TIMINGR1_ASNCR_0) /*!< Own ctrl activity state 3 */
/**
  * @}
  */


/** @defgroup I3C_LL_EC_MAX_DATA_SPEED_LIMITATION Max data speed limitation
  * @{
  */
#define LL_I3C_NO_DATA_SPEED_LIMITATION   0x00000000U   /*!< No max data speed limitation */
#define LL_I3C_MAX_DATA_SPEED_LIMITATION  I3C_BCR_BCR0  /*!< Max data speed limitation */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_IBI_REQUEST_CAPABILITY In-Band Interrupt (IBI) request capability
  * @{
  */
#define LL_I3C_IBI_REQUEST_NOT_SUPPORTED 0x00000000U /*!< IBI request not supported (BCR1 = 0) */
#define LL_I3C_IBI_REQUEST_SUPPORTED     I3C_BCR_BCR1 /*!< IBI request supported (BCR1 = 1) */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_IBI_NO_ADDITIONAL IBI no additional
  * @{
  */
#define LL_I3C_IBI_NO_ADDITIONAL_DATA  0x00000000U   /*!< No data byte follows the accepted IBI */
#define LL_I3C_IBI_ADDITIONAL_DATA     I3C_BCR_BCR2  /*!< A Mandatory data Byte (MDB) follows the accepted IBI */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_OFFLINE_CAPABLE Offline capable
  * @{
  */
#define LL_I3C_NO_OFFLINE_CAPABLE  0x00000000U   /*!< No Offline capable */
#define LL_I3C_OFFLINE_CAPABLE     I3C_BCR_BCR3  /*!< Offline capable */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_VIRTUAL_TARGET Virtual target support
  * @{
  */
#define LL_I3C_VIRTUAL_TARGET_NOT_SUPPORTED 0x00000000U /*!< Virtual target not supported (BCR4 = 0) */
#define LL_I3C_VIRTUAL_TARGET_SUPPORTED     I3C_BCR_BCR4 /*!< Virtual target supported (BCR4 = 1) */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_ADV_CAPABILITIES Advanced capabilities
  * @{
  */
#define LL_I3C_ADV_CAP_NOT_SUPPORTED 0x00000000U /*!< Advanced capabilities not supported (BCR5 = 0) */
#define LL_I3C_ADV_CAP_SUPPORTED     I3C_BCR_BCR5 /*!< Advanced capabilities supported (BCR5 = 1) */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_DEVICE_ROLE_AS Device role as
  * @{
  */
#define LL_I3C_DEVICE_ROLE_AS_TARGET      0x00000000U   /*!< I3C target */
#define LL_I3C_DEVICE_ROLE_AS_CONTROLLER  I3C_BCR_BCR6  /*!< I3C controller */
/**
  * @}
  */


