MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i3c.h
/** @defgroup I3C_LL_EC_IBI_MDB_READ_NOTIFICATION IBI mdb read notification
  * @{
  */
#define LL_I3C_MDB_NO_PENDING_READ_NOTIFICATION  0x00000000U  /*!< No support of pending read notification via
                                                                   the IBI MDB[7:0] value */
#define LL_I3C_MDB_PENDING_READ_NOTIFICATION     I3C_GETCAPR_CAPPEND  /*!< Support of pending read notification via
                                                                           the IBI MDB[7:0] value */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_HANDOFF_GRP_ADDR_NOT Handoff grp addr not
  * @{
  */
#define LL_I3C_HANDOFF_GRP_ADDR_NOT_SUPPORTED 0x00000000U        /*!< Group address handoff is not supported */
#define LL_I3C_HANDOFF_GRP_ADDR_SUPPORTED     I3C_CRCAPR_CAPGRP  /*!< Group address handoff is supported */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_HANDOFF Handoff
  * @{
  */
#define LL_I3C_HANDOFF_NOT_DELAYED  0x00000000U         /*!< Additional time to controllership handoff is not needed */
#define LL_I3C_HANDOFF_DELAYED      I3C_CRCAPR_CAPDHOFF /*!< Additional time to controllership handoff is needed */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_HANDOFF_ACTIVITY_STATE Handoff activity state
  * @{
  */
#define LL_I3C_HANDOFF_ACTIVITY_STATE_0   0x00000000U /*!< Activity state 0 after controllership handoff */
#define LL_I3C_HANDOFF_ACTIVITY_STATE_1   I3C_GETMXDSR_HOFFAS_0 /*!< Activity state 1 after controllership handoff */
#define LL_I3C_HANDOFF_ACTIVITY_STATE_2   I3C_GETMXDSR_HOFFAS_1 /*!< Activity state 2 after controllership handoff */
#define LL_I3C_HANDOFF_ACTIVITY_STATE_3   (I3C_GETMXDSR_HOFFAS_1 | I3C_GETMXDSR_HOFFAS_0) /*!< Activity state 3 after
                                                                                               controllership handoff */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_GETMXDS_FORMAT Getmxds format
  * @{
  */
#define LL_I3C_GETMXDS_FORMAT_1      0x00000000U /*!< GETMXDS CCC format 1 is used, no MaxRdTurn field in response */
#define LL_I3C_GETMXDS_FORMAT_2_LSB  I3C_GETMXDSR_FMT_0 /*!< GETMXDS CCC format 2 is used, MaxRdTurn field in response,
                                                             LSB = RDTURN[7:0] */
#define LL_I3C_GETMXDS_FORMAT_2_MID  I3C_GETMXDSR_FMT_1 /*!< GETMXDS CCC format 2 is used, MaxRdTurn field in response,
                                                             middle byte = RDTURN[7:0] */
#define LL_I3C_GETMXDS_FORMAT_2_MSB  (I3C_GETMXDSR_FMT_1 | I3C_GETMXDSR_FMT_0) /*!< GETMXDS CCC format 2 is used,
                                                                       MaxRdTurn field in response, MSB = RDTURN[7:0] */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_GETMXDS_TSCO Getmxds TSCO
  * @{
  */
#define LL_I3C_TURNAROUND_TIME_TSCO_LESS_12NS     0x00000000U       /*!< clock-to-data turnaround time tSCO <= 12ns */
#define LL_I3C_TURNAROUND_TIME_TSCO_GREATER_12NS  I3C_GETMXDSR_TSCO /*!< clock-to-data turnaround time tSCO > 12ns */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_BUS_ACTIVITY_STATE Bus activity state
  * @{
  */
#define LL_I3C_BUS_ACTIVITY_STATE_0    0x00000000U                       /*!< Controller on the bus activity state 0 */
#define LL_I3C_BUS_ACTIVITY_STATE_1    I3C_DEVR0_AS_0                    /*!< Controller on the bus activity state 1 */
#define LL_I3C_BUS_ACTIVITY_STATE_2    I3C_DEVR0_AS_1                    /*!< Controller on the bus activity state 2 */
#define LL_I3C_BUS_ACTIVITY_STATE_3    (I3C_DEVR0_AS_1 | I3C_DEVR0_AS_0) /*!< Controller on the bus activity state 3 */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_RESET_ACTION Reset action
  * @{
  */
#define LL_I3C_RESET_ACTION_NONE     0x00000000U        /*!< No reset action required */
#define LL_I3C_RESET_ACTION_PARTIAL  I3C_DEVR0_RSTACT_0 /*!< Reset of some internal registers of the peripheral */
#define LL_I3C_RESET_ACTION_FULL     I3C_DEVR0_RSTACT_1 /*!< Reset all internal registers of the peripheral */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_DIRECTION direction
  * @{
  */
#define LL_I3C_DIRECTION_WRITE  0x00000000U   /*!< Write transfer */
#define LL_I3C_DIRECTION_READ   I3C_CR_RNW    /*!< Read transfer */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_GENERATE Generate
  * @{
  */
#define LL_I3C_GENERATE_STOP     I3C_CR_MEND  /*!< Generate stop condition after sending a message */
#define LL_I3C_GENERATE_RESTART  0x00000000U  /*!< Generate Restart condition after sending a message */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_CONTROLLER_MTYPE Controller mtype
  * @{
  */
#define LL_I3C_CONTROLLER_MTYPE_RELEASE     0x00000000U                        /*!< SCL output clock stops running
                                                                                    until next instruction executed */
#define LL_I3C_CONTROLLER_MTYPE_HEADER      I3C_CR_MTYPE_0                     /*!< Header message */
#define LL_I3C_CONTROLLER_MTYPE_PRIVATE     I3C_CR_MTYPE_1                     /*!< Private message Type */
#define LL_I3C_CONTROLLER_MTYPE_DIRECT      (I3C_CR_MTYPE_1 | I3C_CR_MTYPE_0)  /*!< Direct message Type */
#define LL_I3C_CONTROLLER_MTYPE_LEGACY_I2C  I3C_CR_MTYPE_2                     /*!< Legacy I2C message Type */
#define LL_I3C_CONTROLLER_MTYPE_CCC         (I3C_CR_MTYPE_2 | I3C_CR_MTYPE_1)  /*!< Common command Code */
/**
  * @}
  */

/** @defgroup I3C_LL_DEFINE_BYTE Define byte
  * @{
  */
#define LL_I3C_DEFINE_BYTE (0x00000001U) /*!< Define used to construct enum @ref hal_i3c_transfer_mode_t */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_TARGET_MTYPE Target mtype
  * @{
  */
#define LL_I3C_TARGET_MTYPE_HOT_JOIN             I3C_CR_MTYPE_3                     /*!< Hot-Join */
#define LL_I3C_TARGET_MTYPE_CONTROLLER_ROLE_REQ  (I3C_CR_MTYPE_3 | I3C_CR_MTYPE_0)  /*!< Controller-role request */
#define LL_I3C_TARGET_MTYPE_IBI                  (I3C_CR_MTYPE_3 | I3C_CR_MTYPE_1)  /*!< In Band interrupt (IBI) */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_MESSAGE Message
  * @{
  */
#define LL_I3C_MESSAGE_ERROR    0x00000000U   /*!< An error has been detected in the message */
#define LL_I3C_MESSAGE_SUCCESS  I3C_SR_OK     /*!< The message ended with success */
/**
  * @}
  */

