MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i3c.h
/** @defgroup I3C_LL_EC_MESSAGE_DIRECTION Message direction
  * @{
  */
#define LL_I3C_MESSAGE_DIRECTION_WRITE  0x00000000U  /*!< write data or command */
#define LL_I3C_MESSAGE_DIRECTION_READ   I3C_SR_DIR   /*!< read data */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_CONTROLLER_ERROR Controller error
  * @{
  */
#define LL_I3C_CONTROLLER_ERROR_CE0  0x00000000U       /*!< Ctrl detected an illegally formatted CCC */
#define LL_I3C_CONTROLLER_ERROR_CE1  I3C_SER_CODERR_0 /*!< Ctrl detected that Tx data are different than expected */
#define LL_I3C_CONTROLLER_ERROR_CE2  I3C_SER_CODERR_1 /*!< Ctrl detected that broadcast address 7'h7E has been NACKed */
#define LL_I3C_CONTROLLER_ERROR_CE3  (I3C_SER_CODERR_1 | I3C_SER_CODERR_0) /*!< Ctrl detected that new ctrl did not
                                                                          drive the bus after ctrl-role handoff */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_TARGET_ERROR Target error
  * @{
  */
#define LL_I3C_TARGET_ERROR_TE0  I3C_SER_CODERR_3                      /*!< Tgt detected an invalid broadcast address */
#define LL_I3C_TARGET_ERROR_TE1  (I3C_SER_CODERR_3 | I3C_SER_CODERR_0) /*!< Tgt detected an invalid CCC Code */
#define LL_I3C_TARGET_ERROR_TE2  (I3C_SER_CODERR_3 | I3C_SER_CODERR_1) /*!< Tgt detected an invalid write data */
#define LL_I3C_TARGET_ERROR_TE3  (I3C_SER_CODERR_3 | I3C_SER_CODERR_1 | I3C_SER_CODERR_0) /*!< Tgt detected an invalid
                                                                                         assigned address during DAA */
#define LL_I3C_TARGET_ERROR_TE4  (I3C_SER_CODERR_3 | I3C_SER_CODERR_2) /*!< Tgt detected 7'h7E missing after restart
                                                                            during DAA */
#define LL_I3C_TARGET_ERROR_TE5  (I3C_SER_CODERR_3 | I3C_SER_CODERR_2 | I3C_SER_CODERR_0) /*!< Tgt detected an illegally
                                                                                               formatted CCC */
#define LL_I3C_TARGET_ERROR_TE6  (I3C_SER_CODERR_3 | I3C_SER_CODERR_2 | I3C_SER_CODERR_1) /*!< Tgt detected  that
                                                               transmitted data on the bus is different than expected */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_IBI_CAPABILITY In Band Interrupt capability
  * @{
  */
#define LL_I3C_IBI_CAPABILITY     I3C_DEVRX_IBIACK /*!< Ctrl acknowledge tgt IBI capable */
#define LL_I3C_IBI_NO_CAPABILITY  0x00000000U      /*!< Ctrl no acknowledge tgt IBI capable */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_IBI_ADDITIONAL_DATA In Band Interrupt additional data
  * @{
  */
#define LL_I3C_IBI_DATA_ENABLE   I3C_DEVRX_IBIDEN /*!< A mandatory data byte follows the IBI acknowledgement */
#define LL_I3C_IBI_DATA_DISABLE  0x00000000U      /*!< No mandatory data byte follows the IBI acknowledgement */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_CR_CAPABILITY CR capability
  * @{
  */
#define LL_I3C_CR_CAPABILITY     I3C_DEVRX_CRACK  /*!< Ctrl acknowledge tgt ctrl-role capable */
#define LL_I3C_CR_NO_CAPABILITY  0x00000000U      /*!< Ctrl no acknowledge tgt ctrl-role capable */
/**
  * @}
  */

/** @defgroup I3C_LL_EC_SUSPEND_ON_IBI Suspend behavior on IBI
  * @{
  */
#define LL_I3C_SUSP_ENABLE  I3C_DEVRX_SUSP /*!< Suspend current transfer: emit STOP and flush C-FIFO/TX-FIFO after IBI */
#define LL_I3C_SUSP_DISABLE 0x00000000U    /*!< Do not suspend: normal next control flow (restart/stop depends on CR) */
/**
  * @}
  */


/** @defgroup LL_I3C_PAYLOAD_BIT_DEFINITION Payload bit definition
  * @{
  */

/* Private define for CCC command */
#define LL_I3C_BROADCAST_RSTDAA     (0x00000006U) /*!< Bit definition to manage RSTDAA */
#define LL_I3C_BROADCAST_ENTDAA     (0x00000007U) /*!< Bit definition to manage ENTDAA */

/* Private define to split ENTDAA payload */
#define LL_I3C_BCR_IN_PAYLOAD_SHIFT 48 /*!< BCR Position can be used with in ENTDAA payload */
#define LL_I3C_DCR_IN_PAYLOAD_SHIFT 56 /*!< DCR Position can be used with ENTDAA payload */
#define LL_I3C_PID_IN_PAYLOAD_MASK  0xFFFFFFFFFFFFU /*!< Mask can be combined with ENTDAA payload */

/* Private define to split PID */
/* Bits[47:33]: MIPI Manufacturer ID */
#define LL_I3C_MIPIMID_PID_SHIFT    33      /*!< MIPIMID Position can be used with PID */
#define LL_I3C_MIPIMID_PID_MASK     0x7FFFU /*!< Mask can be combined with PID */

/* Bit[32]: Provisioned ID Type Selector */
#define LL_I3C_IDTSEL_PID_SHIFT     32      /*!< IDTSEL Position can be used with PID */
#define LL_I3C_IDTSEL_PID_MASK      0x01U   /*!< Mask can be combined with PID */

/* Bits[31:16]: Part ID */
#define LL_I3C_PART_ID_PID_SHIFT    16      /*!< Part ID Position can be used with PID */
#define LL_I3C_PART_ID_PID_MASK     0xFFFFU /*!< Mask can be combined with PID */

/* Bits[15:12]: MIPI Instance ID */
#define LL_I3C_MIPIID_PID_SHIFT     12      /*!< MIPI Instance ID Position can be used with PID */
#define LL_I3C_MIPIID_PID_MASK      0xFU    /*!< Mask can be combined with PID */

/*  MIPI BCR Bits */
#define LL_I3C_BCR_BCR_POS          (0U)                           /*!< Bus Characteristics */
#define LL_I3C_BCR_BCR_MSK          (0xFFUL << LL_I3C_BCR_BCR_POS) /*!< 0x000000FF */
#define LL_I3C_BCR_BCR0_POS         (0U)                           /*!< Max Data Speed Limitation */
#define LL_I3C_BCR_BCR0_MSK         (0x1UL << LL_I3C_BCR_BCR0_POS) /*!< 0x00000001 */
#define LL_I3C_BCR_BCR1_POS         (1U)                           /*!< IBI Request capable */
#define LL_I3C_BCR_BCR1_MSK         (0x1UL << LL_I3C_BCR_BCR1_POS) /*!< 0x00000002 */
#define LL_I3C_BCR_BCR2_POS         (2U)                           /*!< IBI Payload additional Mandatory Data Byte */
#define LL_I3C_BCR_BCR2_MSK         (0x1UL << LL_I3C_BCR_BCR2_POS) /*!< 0x00000004 */
#define LL_I3C_BCR_BCR3_POS         (3U)                           /*!< Offline capable */
#define LL_I3C_BCR_BCR3_MSK         (0x1UL << LL_I3C_BCR_BCR3_POS) /*!< 0x00000008 */
#define LL_I3C_BCR_BCR4_POS         (4U)                           /*!< Virtual target support */
#define LL_I3C_BCR_BCR4_MSK         (0x1UL << LL_I3C_BCR_BCR4_POS) /*!< 0x00000010 */
#define LL_I3C_BCR_BCR5_POS         (5U)                           /*!< Advanced capabilities */
#define LL_I3C_BCR_BCR5_MSK         (0x1UL << LL_I3C_BCR_BCR5_POS) /*!< 0x00000020 */
#define LL_I3C_BCR_BCR6_POS         (6U)                           /*!< Device role shared during Dyn Addr Assignment */
#define LL_I3C_BCR_BCR6_MSK         (0x1UL << LL_I3C_BCR_BCR6_POS) /*!< 0x00000040 */
/**
  * @}
  */


/** @defgroup LL_I3C_STALL_ENABLE_BIT_DEFINITION stall enable bit definition
  * @{
  */
#define LL_I3C_CTRL_STALL_ACK      I3C_TIMINGR2_STALLA /*!< Inserts a stall after each address or data byte
                                                            ACK/NACK extend target processing time. */

#define LL_I3C_CTRL_STALL_CCC      I3C_TIMINGR2_STALLC /*!< Inserts a stall on the parity (T) bit phase of a
                                                            direct/broadcast CCC so targets can decode the
                                                            opcode before data phase. */

#define LL_I3C_CTRL_STALL_TX       I3C_TIMINGR2_STALLD /*!< Inserts a stall on the parity (T) bit of transmitted
                                                            data allowing target additional time to latch received
                                                            byte. */

#define LL_I3C_CTRL_STALL_RX       I3C_TIMINGR2_STALLT /*!< Inserts a stall before the controller samples target
                                                            data (read path) so target can prepare next byte. */

