MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i3c.h
#define LL_I3C_CTRL_STALL_I2C_ACK  I3C_TIMINGR2_STALLL /*!< Inserts a stall after address ACK/NACK in legacy I2C
                                                            read/write so target can prepare for next phase. */

#define LL_I3C_CTRL_STALL_I2C_TX   I3C_TIMINGR2_STALLS /*!< Inserts a stall after data ACK/NACK in legacy I2C write
                                                            allowing target to process/write incoming byte. */

#define LL_I3C_CTRL_STALL_I2C_RX   I3C_TIMINGR2_STALLR /*!< Inserts a stall after data ACK/NACK in legacy I2C read
                                                            so target can load the next byte to transmit. */

#define LL_I3C_CTRL_STALL_ALL      (LL_I3C_CTRL_STALL_ACK | LL_I3C_CTRL_STALL_CCC | LL_I3C_CTRL_STALL_TX \
                                    | LL_I3C_CTRL_STALL_RX | LL_I3C_CTRL_STALL_I2C_ACK | LL_I3C_CTRL_STALL_I2C_TX \
                                    | LL_I3C_CTRL_STALL_I2C_RX) /*!< Enable all stall points. */
#define LL_I3C_CTRL_STALL_NONE     0UL                    /*!< Disable all stall insertion (default high throughput). */
/**
  * @}
  */


/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup I3C_LL_Exported_Macros LL I3C Macros
  * @{
  */

/** @defgroup I3C_LL_EM_WRITE_READ Common write and read registers Macros
  * @{
  */

/** @brief  Get Bus Characteristics from payload (64bits) receive during ENTDAA procedure.
  * @param  PAYLOAD specifies the Bus Characteristics capabilities retrieve during ENTDAA procedure.
  *         This parameter must be a number between Min_Data=0x00(uint64_t) and Max_Data=0xFFFFFFFFFFFFFFFFFF.
  * @retval The value of BCR Return value between Min_Data=0x00 and Max_Data=0xFF.
  */
#define LL_I3C_GET_BCR(PAYLOAD) (((uint32_t)((uint64_t)(PAYLOAD) >> LL_I3C_BCR_IN_PAYLOAD_SHIFT)) & I3C_BCR_BCR)

/** @brief  Check IBI request capabilities.
  * @param  BCR specifies the Bus Characteristics capabilities retrieve during ENTDAA procedure.
  *         This parameter must be a number between Min_Data=0x00 and Max_Data=0xFF.
  * @retval Value of @ref I3C_LL_EC_IBI_CAPABILITY.
  */
#define LL_I3C_GET_IBI_CAPABLE(BCR) (((((BCR) & I3C_BCR_BCR1_Msk) >> I3C_BCR_BCR1_Pos) == 1U) \
                                     ? LL_I3C_IBI_CAPABILITY : LL_I3C_IBI_NO_CAPABILITY)

/** @brief  Check IBI additional data byte capabilities.
  * @param  BCR specifies the Bus Characteristics capabilities retrieve during ENTDAA procedure.
  *         This parameter must be a number between Min_Data=0x00 and Max_Data=0xFF.
  * @retval Value of @ref I3C_LL_EC_IBI_ADDITIONAL_DATA.
  */
#define LL_I3C_GET_IBI_PAYLOAD(BCR) (((((BCR) & I3C_BCR_BCR2_Msk) >> I3C_BCR_BCR2_Pos) == 1U) \
                                     ? LL_I3C_IBI_DATA_ENABLE : LL_I3C_IBI_DATA_DISABLE)

/** @brief  Check controller role request capabilities.
  * @param  BCR specifies the Bus Characteristics capabilities retrieve during ENTDAA procedure.
  *         This parameter must be a number between Min_Data=0x00 and Max_Data=0xFF.
  * @retval Value of @ref I3C_LL_EC_CR_CAPABILITY.
  */
#define LL_I3C_GET_CR_CAPABLE(BCR) (((((BCR) & I3C_BCR_BCR6_Msk) >> I3C_BCR_BCR6_Pos) == 1U) \
                                    ? LL_I3C_CR_CAPABILITY : LL_I3C_CR_NO_CAPABILITY)

/**
  * @brief  Write a value in I3C register.
  * @param  INSTANCE I3C Instance
  * @param  REG Register to be written
  * @param  VALUE Value to be written in the register
  */
#define LL_I3C_WRITE_REG(INSTANCE, REG, VALUE) STM32_WRITE_REG((INSTANCE)->REG, (VALUE))

/**
  * @brief  Read a value in I3C register.
  * @param  INSTANCE I3C Instance
  * @param  REG Register to be read
  * @retval Register value
  */
#define LL_I3C_READ_REG(INSTANCE, REG) STM32_READ_REG((INSTANCE)->REG)
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup I3C_LL_Exported_Functions LL I3C Functions
  * @{
  */

/** @defgroup I3C_LL_EF_Configuration Configuration
  * @{
  */

/**
  * @brief  Enable I3C peripheral (EN = 1).
  * @rmtoll
  *  CFGR      EN            LL_I3C_Enable
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_Enable(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_EN);
}

/**
  * @brief  Disable I3C peripheral (EN = 0).
  * @rmtoll
  *  CFGR      EN            LL_I3C_Disable
  * @param  p_i3c I3C Instance.
  * @note   Controller mode: before clearing EN, all possible target requests must be disabled using DISEC CCC.
  *         Target mode: software is not expected clearing EN unless a partial reset of the IP is needed
  */
__STATIC_INLINE void LL_I3C_Disable(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->CFGR, I3C_CFGR_EN);
}

/**
  * @brief  Check if the I3C peripheral is enabled or disabled.
  * @rmtoll
  *  CFGR      EN            LL_I3C_IsEnabled
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabled(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_EN) == (I3C_CFGR_EN)) ? 1UL : 0UL);
}

/**
  * @brief  Return raw CFGR register value.
  * @rmtoll CFGR * LL_I3C_GetRegister_CFGR
  * @param  p_i3c I3C Instance.
  * @retval 32-bit CFGR register content.
  */
__STATIC_INLINE uint32_t LL_I3C_GetRegister_CFGR(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)STM32_READ_REG(p_i3c->CFGR);
}

/**
  * @brief  Return raw IER register value.
  * @rmtoll IER *  LL_I3C_GetEnabledIT
  * @param  p_i3c I3C Instance.
  * @retval 32-bit IER register content.
  */
__STATIC_INLINE uint32_t  LL_I3C_GetEnabledIT(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)STM32_READ_REG(p_i3c->IER);
}

/**
  * @brief  Return masked EVR flags state.
  * @rmtoll EVR * LL_I3C_GetFlag
  * @param  p_i3c I3C Instance.
  * @param  flags Mask of EVR bits to check (OR-combination of EVR flags).
  * @retval Masked EVR value (non-zero bits indicate set flags).
  */
__STATIC_INLINE uint32_t LL_I3C_GetFlag(const I3C_TypeDef *p_i3c, uint32_t flags)
{
  return (uint32_t)(STM32_READ_REG(p_i3c->EVR) & (uint32_t)flags);
}

/**
  * @brief  Return raw GETMXDSR register value.
  * @rmtoll GETMXDSR * LL_I3C_GetRegister_GETMXDSR
  * @param  p_i3c I3C Instance.
  * @retval 32-bit GETMXDSR register content.
  */
__STATIC_INLINE uint32_t LL_I3C_GetRegister_GETMXDSR(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)STM32_READ_REG(p_i3c->GETMXDSR);
}

/**
  * @brief  Return raw MISR register value.
  * @rmtoll MISR * LL_I3C_GetRegister_MISR
  * @param  p_i3c I3C Instance.
  * @retval 32-bit MISR register content.
  */
__STATIC_INLINE uint32_t LL_I3C_GetRegister_MISR(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)STM32_READ_REG(p_i3c->MISR);
}

/**
  * @brief  Return raw BCR register value.
  * @rmtoll BCR * LL_I3C_GetRegister_BCR
  * @param  p_i3c I3C Instance.
  * @retval 32-bit BCR register content.
  */
__STATIC_INLINE uint32_t LL_I3C_GetRegister_BCR(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)STM32_READ_REG(p_i3c->BCR);
}

/**
  * @brief  Return raw SER register value.
  * @rmtoll SER * LL_I3C_GetRegister_SER
  * @param  p_i3c I3C Instance.
  * @retval 32-bit SER register content.
  */
__STATIC_INLINE uint32_t LL_I3C_GetRegister_SER(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)STM32_READ_REG(p_i3c->SER);
}

/**
  * @brief  Return raw TIMINGR2 register value.
  * @rmtoll TIMINGR2 * LL_I3C_GetRegister_TIMINGR2
  * @param  p_i3c I3C Instance.
  * @retval 32-bit TIMINGR2 register content.
  */
__STATIC_INLINE uint32_t LL_I3C_GetRegister_TIMINGR2(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)STM32_READ_REG(p_i3c->TIMINGR2);
}

/**
  * @brief  Write raw value into CR register.
  * @rmtoll CR * LL_I3C_SetRegister_CR
  * @param  p_i3c I3C Instance.
  * @param  cr_value 32-bit value to program in CR.
  */
__STATIC_INLINE void LL_I3C_SetRegister_CR(I3C_TypeDef *p_i3c, uint32_t cr_value)
{
  LL_I3C_WRITE_REG(p_i3c, CR, cr_value);
}

/**
  * @brief  Check if reset action is required or not required.
  * @rmtoll
  *  DEVR0        RSTVAL        LL_I3C_IsEnabledReset
  * @param  p_i3c I3C Instance.
  * @note   This bit indicates if reset action field has been updated by HW upon reception
  *         of RSTACT during current frame.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledReset(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->DEVR0, I3C_DEVR0_RSTVAL) == (I3C_DEVR0_RSTVAL)) ? 1UL : 0UL);
}

/**
  * @brief  Configure peripheral mode.
  * @rmtoll
  *  CFGR      CRINIT       LL_I3C_SetMode
  * @param  p_i3c I3C Instance.
  * @param  peripheral_mode This parameter can be one of the following values:
  *         @arg @ref LL_I3C_MODE_CONTROLLER
  *         @arg @ref LL_I3C_MODE_TARGET
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_SetMode(I3C_TypeDef *p_i3c, uint32_t peripheral_mode)
{
  STM32_MODIFY_REG(p_i3c->CFGR, I3C_CFGR_CRINIT, peripheral_mode);
}

/**
  * @brief  Get peripheral mode.
  * @rmtoll
  *  CFGR      CRINIT       LL_I3C_GetMode
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_MODE_CONTROLLER
  *         @arg @ref LL_I3C_MODE_TARGET
  */
__STATIC_INLINE uint32_t LL_I3C_GetMode(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_CRINIT);
}

/**
  * @brief  An arbitration header (7'h7E) is sent after start in case of legacy I2C or I3C private transfers.
  * @rmtoll
  *  CFGR      NOARBH        LL_I3C_EnableArbitrationHeader
  * @param  p_i3c I3C Instance.
  * @note   This bit can be modified only when there is no frame ongoing
  */
__STATIC_INLINE void LL_I3C_EnableArbitrationHeader(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->CFGR, I3C_CFGR_NOARBH);
}

/**
  * @brief  Target address is sent directly after a start in case of legacy I2C or I3C private transfers.
  * @rmtoll
  *  CFGR      NOARBH        LL_I3C_DisableArbitrationHeader
  * @param  p_i3c I3C Instance.
  * @note   This bit can be modified only when there is no frame ongoing

  */
__STATIC_INLINE void LL_I3C_DisableArbitrationHeader(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_NOARBH);
}

/**
  * @brief  Check if the arbitration header is enabled or disabled.
  * @rmtoll
  *  CFGR      NOARBH        LL_I3C_IsEnabledArbitrationHeader
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledArbitrationHeader(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_NOARBH) == (I3C_CFGR_NOARBH)) ? 0UL : 1UL);
}

/**
  * @brief  A reset pattern is inserted before the STOP at the end of a frame when the last CCC
  *         of the frame was RSTACT CCC.
  * @rmtoll
  *  CFGR      RSTPTRN       LL_I3C_EnableResetPattern
  * @param  p_i3c I3C Instance.
  * @note   This bit can be modified only when there is no frame ongoing
  */
__STATIC_INLINE void LL_I3C_EnableResetPattern(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_RSTPTRN);
}

/**
  * @brief  A single STOP is emitted at the end of a frame.
  * @rmtoll
  *  CFGR      RSTPTRN       LL_I3C_DisableResetPattern
  * @param  p_i3c I3C Instance.
  * @note   This bit can be modified only when there is no frame ongoing
  */
__STATIC_INLINE void LL_I3C_DisableResetPattern(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->CFGR, I3C_CFGR_RSTPTRN);
}

/**
  * @brief  Check if reset pattern is enabled or disabled.
  * @rmtoll
  *  CFGR      RSTPTRN       LL_I3C_IsEnabledResetPattern
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledResetPattern(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_RSTPTRN) == (I3C_CFGR_RSTPTRN)) ? 1UL : 0UL);
}

/**
  * @brief  An exit pattern is sent after header (MTYPE = header) to program an escalation fault.
  * @rmtoll
  *  CFGR      EXITPTRN      LL_I3C_EnableExitPattern
  * @param  p_i3c I3C Instance.
  * @note   This bit can be modified only when there is no frame ongoing
  */
__STATIC_INLINE void LL_I3C_EnableExitPattern(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_EXITPTRN);
}

/**
  * @brief  An exit pattern is not sent after header (MTYPE = header).
  * @rmtoll
  *  CFGR      EXITPTRN      LL_I3C_DisableExitPattern
  * @param  p_i3c I3C Instance.
  * @note   This bit can be modified only when there is no frame ongoing
  */
__STATIC_INLINE void LL_I3C_DisableExitPattern(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->CFGR, I3C_CFGR_EXITPTRN);
}

/**
  * @brief  Check if exit pattern is enabled or disabled.
  * @rmtoll
  *  CFGR      EXITPTRN      LL_I3C_IsEnabledExitPattern
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledExitPattern(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_EXITPTRN) == (I3C_CFGR_EXITPTRN)) ? 1UL : 0UL);
}

/**
  * @brief  High keeper is enabled and will be used in place of standard open drain pull up device
  *         during handoff procedures.
  * @rmtoll
  *  CFGR      HKSDAEN       LL_I3C_EnableHighKeeperSDA
  * @param  p_i3c I3C Instance.
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_EnableHighKeeperSDA(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_HKSDAEN);
}

/**
  * @brief  High keeper is disabled.
  * @rmtoll
  *  CFGR      HKSDAEN       LL_I3C_DisableHighKeeperSDA
  * @param  p_i3c I3C Instance.
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_DisableHighKeeperSDA(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->CFGR, I3C_CFGR_HKSDAEN);
}

/**
  * @brief  Check if High keeper is enabled or disabled.
  * @rmtoll
  *  CFGR      HKSDAEN       LL_I3C_IsEnabledHighKeeperSDA
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledHighKeeperSDA(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_HKSDAEN) == (I3C_CFGR_HKSDAEN)) ? 1UL : 0UL);
}

/**
  * @brief  Hot-Join request is acked. Current frame on the bus is continued.
  *         A Hot-Join interrupt is sent through HJF flag.
  * @rmtoll
  *  CFGR      HJACK         LL_I3C_EnableHJAck
  * @param  p_i3c I3C Instance.
  * @note   This bit can be used when I3C is acting as a controller.
  */
__STATIC_INLINE void LL_I3C_EnableHJAck(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_HJACK);
}

/**
  * @brief  Hot-Join request is NACKed. Current frame on the bus is continued.
  *         No Hot-Join interrupt is generated.
  * @rmtoll
  *  CFGR      HJACK         LL_I3C_DisableHJAck
  * @param  p_i3c I3C Instance.
  * @note   This bit can be used when I3C is acting as a controller.
  */
__STATIC_INLINE void LL_I3C_DisableHJAck(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->CFGR, I3C_CFGR_HJACK);
}

/**
  * @brief  Check if Hot-Join request acknowledgement is enabled or disabled.
  * @rmtoll
  *  CFGR      HJACK         LL_I3C_IsEnabledHJAck
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledHJAck(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_HJACK) == (I3C_CFGR_HJACK)) ? 1UL : 0UL);
}

/**
  * @brief  Get the data register address used for DMA transfer.
  * @rmtoll
  *  TDR          TDB0          LL_I3C_DMA_GetRegAddr \n
  *  TDWR         TDWR          LL_I3C_DMA_GetRegAddr \n
  *  RDR          RXRB0         LL_I3C_DMA_GetRegAddr \n
  *  RDWR         RDWR          LL_I3C_DMA_GetRegAddr \n
  *  SR           SR            LL_I3C_DMA_GetRegAddr \n
  *  CR           CR            LL_I3C_DMA_GetRegAddr
  * @param  p_i3c I3C Instance
  * @param  direction This parameter can be one of the following values:
  *         @arg @ref LL_I3C_DMA_REG_DATA_TRANSMIT_BYTE
  *         @arg @ref LL_I3C_DMA_REG_DATA_RECEIVE_BYTE
  *         @arg @ref LL_I3C_DMA_REG_DATA_TRANSMIT_WORD
  *         @arg @ref LL_I3C_DMA_REG_DATA_RECEIVE_WORD
  *         @arg @ref LL_I3C_DMA_REG_STATUS
  *         @arg @ref LL_I3C_DMA_REG_CONTROL
  * @retval Address of data register
  */
__STATIC_INLINE uint32_t LL_I3C_DMA_GetRegAddr(const I3C_TypeDef *p_i3c, uint32_t direction)
{
  uint32_t data_reg_addr;

  if (direction == LL_I3C_DMA_REG_DATA_TRANSMIT_BYTE)
  {
    /* return address of TDR register */
    data_reg_addr = (uint32_t) &(p_i3c->TDR);
  }
  else if (direction == LL_I3C_DMA_REG_DATA_RECEIVE_BYTE)
  {
    /* return address of RDR register */
    data_reg_addr = (uint32_t) &(p_i3c->RDR);
  }
  else if (direction == LL_I3C_DMA_REG_DATA_TRANSMIT_WORD)
  {
    /* return address of TDWR register */
    data_reg_addr = (uint32_t) &(p_i3c->TDWR);
  }
  else if (direction == LL_I3C_DMA_REG_DATA_RECEIVE_WORD)
  {
    /* return address of RDWR register */
    data_reg_addr = (uint32_t) &(p_i3c->RDWR);
  }
  else if (direction == LL_I3C_DMA_REG_STATUS)
  {
    /* return address of SR register */
    data_reg_addr = (uint32_t) &(p_i3c->SR);
  }
  else
  {
    /* return address of CR register */
    data_reg_addr = (uint32_t) &(p_i3c->CR);
  }

  return data_reg_addr;
}

/**
  * @brief  Enable DMA FIFO reception requests.
  * @rmtoll
  *  CFGR      RXDMAEN       LL_I3C_EnableDMAReq_RX
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableDMAReq_RX(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_RXDMAEN);
}

/**
  * @brief  Disable DMA FIFO reception requests.
  * @rmtoll
  *  CFGR      RXDMAEN       LL_I3C_DisableDMAReq_RX
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableDMAReq_RX(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->CFGR, I3C_CFGR_RXDMAEN);
}

/**
  * @brief  Check if DMA FIFO reception requests are enabled or disabled.
  * @rmtoll
  *  CFGR      RXDMAEN       LL_I3C_IsEnabledDMAReq_RX
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledDMAReq_RX(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_RXDMAEN) == (I3C_CFGR_RXDMAEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the receive FIFO threshold level.
  * @rmtoll
  *  CFGR      RXTHRES       LL_I3C_SetRxFIFOThreshold
  * @param  p_i3c I3C Instance.
  * @param  rx_fifo_threshold This parameter can be one of the following values:
  *         @arg @ref LL_I3C_RXFIFO_THRESHOLD_1_8
  *         @arg @ref LL_I3C_RXFIFO_THRESHOLD_1_2
  */
__STATIC_INLINE void LL_I3C_SetRxFIFOThreshold(I3C_TypeDef *p_i3c, uint32_t rx_fifo_threshold)
{
  STM32_MODIFY_REG(p_i3c->CFGR, I3C_CFGR_RXTHRES, rx_fifo_threshold);
}

/**
  * @brief  Get the receive FIFO threshold level.
  * @rmtoll
  *  CFGR      RXTHRES       LL_I3C_GetRxFIFOThreshold
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_RXFIFO_THRESHOLD_1_8
  *         @arg @ref LL_I3C_RXFIFO_THRESHOLD_1_2
  */
__STATIC_INLINE uint32_t LL_I3C_GetRxFIFOThreshold(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_RXTHRES));
}

/**
  * @brief  Enable DMA FIFO transmission requests.
  * @rmtoll
  *  CFGR      TXDMAEN       LL_I3C_EnableDMAReq_TX
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableDMAReq_TX(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_TXDMAEN);
}

/**
  * @brief  Disable DMA FIFO transmission requests.
  * @rmtoll
  *  CFGR      TXDMAEN       LL_I3C_DisableDMAReq_TX
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableDMAReq_TX(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->CFGR, I3C_CFGR_TXDMAEN);
}

/**
  * @brief  Check if DMA FIFO transmission requests are enabled or disabled.
  * @rmtoll
  *  CFGR      TXDMAEN       LL_I3C_IsEnabledDMAReq_TX
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledDMAReq_TX(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_TXDMAEN) == (I3C_CFGR_TXDMAEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the transmit FIFO threshold level.
  * @rmtoll
  *  CFGR      TXTHRES       LL_I3C_SetTxFIFOThreshold
  * @param  p_i3c I3C Instance.
  * @param  tx_fifo_threshold This parameter can be one of the following values:
  *         @arg @ref LL_I3C_TXFIFO_THRESHOLD_1_8
  *         @arg @ref LL_I3C_TXFIFO_THRESHOLD_1_2
  */
__STATIC_INLINE void LL_I3C_SetTxFIFOThreshold(I3C_TypeDef *p_i3c, uint32_t tx_fifo_threshold)
{
  STM32_MODIFY_REG(p_i3c->CFGR, I3C_CFGR_TXTHRES, tx_fifo_threshold);
}

/**
  * @brief  Get the transmit FIFO threshold level.
  * @rmtoll
  *  CFGR      TXTHRES       LL_I3C_GetTxFIFOThreshold
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_TXFIFO_THRESHOLD_1_8
  *         @arg @ref LL_I3C_TXFIFO_THRESHOLD_1_2
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_GetTxFIFOThreshold(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_TXTHRES));
}

/**
  * @brief  Get controller FIFO configuration.
  * @rmtoll
  *  CFGR     TMODE    LL_I3C_GetCtrlFifo \n
  *  CFGR     SMODE    LL_I3C_GetCtrlFifo
  * @param  p_i3c I3C Instance.
  * @retval One of:
  *         @ref LL_I3C_CTRL_FIFO_NONE
  *         @ref LL_I3C_CTRL_FIFO_CONTROL_ONLY
  *         @ref LL_I3C_CTRL_FIFO_STATUS_ONLY
  *         @ref LL_I3C_CTRL_FIFO_ALL
  */
__STATIC_INLINE uint32_t LL_I3C_GetCtrlFifo(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->CFGR, (I3C_CFGR_TMODE | I3C_CFGR_SMODE)));
}

/**
  * @brief  Enable DMA FIFO status requests.
  * @rmtoll
  *  CFGR      SDMAEN        LL_I3C_EnableDMAReq_Status
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableDMAReq_Status(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_SDMAEN);
}

/**
  * @brief  Disable DMA FIFO status requests.
  * @rmtoll
  *  CFGR      SDMAEN        LL_I3C_DisableDMAReq_Status
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableDMAReq_Status(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->CFGR, I3C_CFGR_SDMAEN);
}

/**
  * @brief  Check if DMA FIFO status requests are enabled or disabled.
  * @rmtoll
  *  CFGR      SDMAEN        LL_I3C_IsEnabledDMAReq_Status
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledDMAReq_Status(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_SDMAEN) == (I3C_CFGR_SDMAEN)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the controller fifo.
  * @rmtoll
  *  CFGR     TXTHRES    LL_I3C_ConfigCtrlFifo \n
  *  CFGR     RXTHRES    LL_I3C_ConfigCtrlFifo \n
  *  CFGR     TMODE      LL_I3C_ConfigCtrlFifo \n
  *  CFGR     SMODE      LL_I3C_ConfigCtrlFifo
  * @param  p_i3c I3C Instance.
  * @param  tx_fifo_threshold One of @ref LL_I3C_TXFIFO_THRESHOLD_1_8 or @ref LL_I3C_TXFIFO_THRESHOLD_1_2.
  * @param  rx_fifo_threshold One of @ref LL_I3C_RXFIFO_THRESHOLD_1_8 or @ref LL_I3C_RXFIFO_THRESHOLD_1_2.
  * @param  ctrl_fifo One of @ref LL_I3C_CTRL_FIFO_NONE, @ref LL_I3C_CTRL_FIFO_CONTROL_ONLY,
  *                   @ref LL_I3C_CTRL_FIFO_STATUS_ONLY, @ref LL_I3C_CTRL_FIFO_ALL.
  * @note   These bits can only be programmed when EN = 0.
  */
__STATIC_INLINE void LL_I3C_ConfigCtrlFifo(I3C_TypeDef *p_i3c,
                                           uint32_t tx_fifo_threshold,
                                           uint32_t rx_fifo_threshold,
                                           uint32_t ctrl_fifo)
{
  STM32_MODIFY_REG(p_i3c->CFGR, (I3C_CFGR_TXTHRES | I3C_CFGR_RXTHRES | I3C_CFGR_TMODE | I3C_CFGR_SMODE), \
                   tx_fifo_threshold | rx_fifo_threshold | ctrl_fifo);
}

