MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i3c.h
/**
  * @brief  Configure the target fifo.
  * @rmtoll
  *  CFGR     TXTHRES    LL_I3C_ConfigTgtFifo \n
  *  CFGR     RXTHRES    LL_I3C_ConfigTgtFifo
  * @param  p_i3c I3C Instance.
  * @param  tx_fifo_threshold One of @ref LL_I3C_TXFIFO_THRESHOLD_1_8 or @ref LL_I3C_TXFIFO_THRESHOLD_1_2.
  * @param  rx_fifo_threshold One of @ref LL_I3C_RXFIFO_THRESHOLD_1_8 or @ref LL_I3C_RXFIFO_THRESHOLD_1_2.
  * @note   These bits can only be programmed when EN = 0.
  */
__STATIC_INLINE void LL_I3C_ConfigTgtFifo(I3C_TypeDef *p_i3c,
                                          uint32_t tx_fifo_threshold,
                                          uint32_t rx_fifo_threshold)
{
  STM32_MODIFY_REG(p_i3c->CFGR, (I3C_CFGR_TXTHRES | I3C_CFGR_RXTHRES), tx_fifo_threshold | rx_fifo_threshold);
}

/**
  * @brief  Enable the status FIFO.
  * @rmtoll
  *  CFGR      SMODE         LL_I3C_EnableStatusFIFO
  * @param  p_i3c I3C Instance.
  * @note   Not applicable in target mode. status FIFO always disabled in target mode.
  * @rmtoll
  *  CFGR      SMODE         LL_I3C_EnableStatusFIFO
  */
__STATIC_INLINE void LL_I3C_EnableStatusFIFO(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_SMODE);
}

/**
  * @brief  Disable the status FIFO threshold.
  * @rmtoll
  *  CFGR      SMODE         LL_I3C_DisableStatusFIFO
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableStatusFIFO(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->CFGR, I3C_CFGR_SMODE);
}

/**
  * @brief  Check if the status FIFO threshold is enabled or disabled.
  * @rmtoll
  *  CFGR      SMODE         LL_I3C_IsEnabledStatusFIFO
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledStatusFIFO(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_SMODE) == (I3C_CFGR_SMODE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the control and transmit FIFO preloaded before starting a transfer on I3C bus.
  * @param  p_i3c I3C Instance.
  * @note   Not applicable in target mode. control FIFO always disabled in target mode.
  * @rmtoll
  *  CFGR      TMODE         LL_I3C_EnableControlFIFO
  */
__STATIC_INLINE void LL_I3C_EnableControlFIFO(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_TMODE);
}

/**
  * @brief  Disable the control and transmit FIFO preloaded before starting a transfer on I3C bus.
  * @rmtoll
  *  CFGR      TMODE         LL_I3C_DisableControlFIFO
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableControlFIFO(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->CFGR, I3C_CFGR_TMODE);
}

/**
  * @brief  Check if the control and transmit FIFO preloaded is enabled or disabled.
  * @rmtoll
  *  CFGR      TMODE         LL_I3C_IsEnabledControlFIFO
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledControlFIFO(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_TMODE) == (I3C_CFGR_TMODE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable DMA FIFO control word transfer requests.
  * @rmtoll
  *  CFGR      CDMAEN        LL_I3C_EnableDMAReq_Control
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableDMAReq_Control(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_CDMAEN);
}

/**
  * @brief  Disable DMA FIFO control word transfer requests.
  * @rmtoll
  *  CFGR      CDMAEN        LL_I3C_DisableDMAReq_Control
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableDMAReq_Control(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->CFGR, I3C_CFGR_CDMAEN);
}

/**
  * @brief  Disable all I3C DMA request sources (Control, RX, TX, Status) with a single register access.
  * @rmtoll
  *  CFGR      CDMAEN     LL_I3C_DisableAllDMARequests \n
  *  CFGR      RXDMAEN    LL_I3C_DisableAllDMARequests \n
  *  CFGR      TXDMAEN    LL_I3C_DisableAllDMARequests \n
  *  CFGR      SDMAEN     LL_I3C_DisableAllDMARequests
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableAllDMARequests(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->CFGR, (I3C_CFGR_CDMAEN | I3C_CFGR_RXDMAEN | I3C_CFGR_TXDMAEN | I3C_CFGR_SDMAEN));
}

/**
  * @brief  Check if DMA FIFO control word transfer requests are enabled or disabled.
  * @rmtoll
  *  CFGR      CDMAEN        LL_I3C_IsEnabledDMAReq_Control
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledDMAReq_Control(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_CDMAEN) == (I3C_CFGR_CDMAEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set Own dynamic address as Valid.
  * @rmtoll
  *  DEVR0        DAVAL         LL_I3C_EnableOwnDynAddress
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableOwnDynAddress(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->DEVR0, I3C_DEVR0_DAVAL);
}

/**
  * @brief  Configure Own dynamic address and set it valid in one operation.
  * @rmtoll
  *  DEVR0        DA,DAVAL     LL_I3C_SetAndEnableOwnDynamicAddress
  * @param  p_i3c I3C Instance.
  * @param  own_dynamic_address Value between 0 and 0x7F.
  */
__STATIC_INLINE void LL_I3C_SetAndEnableOwnDynamicAddress(I3C_TypeDef *p_i3c, uint32_t own_dynamic_address)
{
  /* Program dynamic address and set address valid */
  STM32_MODIFY_REG(p_i3c->DEVR0, I3C_DEVR0_DA | I3C_DEVR0_DAVAL, \
                   (own_dynamic_address << I3C_DEVR0_DA_Pos) | I3C_DEVR0_DAVAL);
}

/**
  * @brief  Set Own dynamic address as not-Valid.
  * @rmtoll
  *  DEVR0        DAVAL         LL_I3C_DisableOwnDynAddress
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableOwnDynAddress(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->DEVR0, I3C_DEVR0_DAVAL);
}

/**
  * @brief  Check if own dynamic address is valid or not valid.
  * @rmtoll
  *  DEVR0        DAVAL         LL_I3C_IsEnabledOwnDynAddress
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledOwnDynAddress(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->DEVR0, I3C_DEVR0_DAVAL) == (I3C_DEVR0_DAVAL)) ? 1UL : 0UL);
}

/**
  * @brief  Configure Own dynamic address.
  * @rmtoll
  *  DEVR0        DA            LL_I3C_SetOwnDynamicAddress
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed in controller mode or during dynamic address procedure from current controller.
  * @param  own_dynamic_address This parameter must be a value between Min_Data=0 and Max_Data=0x7F
  */
__STATIC_INLINE void LL_I3C_SetOwnDynamicAddress(I3C_TypeDef *p_i3c, uint32_t own_dynamic_address)
{
  STM32_MODIFY_REG(p_i3c->DEVR0, I3C_DEVR0_DA, (own_dynamic_address << I3C_DEVR0_DA_Pos));
}

/**
  * @brief  Get Own dynamic address.
  * @rmtoll
  *  DEVR0        DA            LL_I3C_GetOwnDynamicAddress
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0x7F
  */
__STATIC_INLINE uint8_t LL_I3C_GetOwnDynamicAddress(const I3C_TypeDef *p_i3c)
{
  return (uint8_t)(STM32_READ_BIT(p_i3c->DEVR0, I3C_DEVR0_DA) >> I3C_DEVR0_DA_Pos);
}

/**
  * @brief  Set IBI procedure allowed (when the I3C is acting as target).
  * @rmtoll
  *  DEVR0        IBIEN         LL_I3C_EnableIBI
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0) or updated by HW upon reception of DISEC CCC.
  */
__STATIC_INLINE void LL_I3C_EnableIBI(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->DEVR0, I3C_DEVR0_IBIEN);
}

/**
  * @brief  Set IBI procedure not-allowed (when the I3C is acting as target).
  * @rmtoll
  *  DEVR0        IBIEN         LL_I3C_DisableIBI
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0) or updated by HW upon reception of DISEC CCC.
  */
__STATIC_INLINE void LL_I3C_DisableIBI(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->DEVR0, I3C_DEVR0_IBIEN);
}

/**
  * @brief  Check if IBI procedure is allowed or not allowed.
  * @rmtoll
  *  DEVR0        IBIEN         LL_I3C_IsEnabledIBI
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIBI(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->DEVR0, I3C_DEVR0_IBIEN) == (I3C_DEVR0_IBIEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set controller-role request allowed (when the I3C is acting as target).
  * @rmtoll
  *  DEVR0        CREN          LL_I3C_EnableControllerRoleReq
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0) or updated by HW upon reception of DISEC CCC.
  */
__STATIC_INLINE void LL_I3C_EnableControllerRoleReq(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->DEVR0, I3C_DEVR0_CREN);
}

/**
  * @brief  Set controller-role request as not-allowed (when the I3C is acting as target).
  * @rmtoll
  *  DEVR0        CREN          LL_I3C_DisableControllerRoleReq
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0) or updated by HW upon reception of DISEC CCC.
  */
__STATIC_INLINE void LL_I3C_DisableControllerRoleReq(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->DEVR0, I3C_DEVR0_CREN);
}

/**
  * @brief  Check if controller-role request is allowed or not-allowed.
  * @rmtoll
  *  DEVR0        CREN          LL_I3C_IsEnabledControllerRoleReq
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledControllerRoleReq(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->DEVR0, I3C_DEVR0_CREN) == (I3C_DEVR0_CREN)) ? 1UL : 0UL);
}

/**
  * @brief  Set Hot-Join allowed (when the I3C is acting as target).
  * @rmtoll
  *  DEVR0        HJEN          LL_I3C_EnableHotJoin
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0) or updated by HW upon reception of DISEC CCC.
  */
__STATIC_INLINE void LL_I3C_EnableHotJoin(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->DEVR0, I3C_DEVR0_HJEN);
}

/**
  * @brief  Set Hot-Join as not-allowed (when the I3C is acting as target).
  * @rmtoll
  *  DEVR0        HJEN          LL_I3C_DisableHotJoin
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0) or updated by HW upon reception of DISEC CCC.
  */
__STATIC_INLINE void LL_I3C_DisableHotJoin(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->DEVR0, I3C_DEVR0_HJEN);
}

/**
  * @brief  Check if Hot-Join is allowed or not-allowed.
  * @rmtoll
  *  DEVR0        HJEN          LL_I3C_IsEnabledHotJoin
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledHotJoin(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->DEVR0, I3C_DEVR0_HJEN) == (I3C_DEVR0_HJEN)) ? 1UL : 0UL);
}

/**
  * @brief  Configure maximum read length (target mode).
  * @rmtoll
  *  MAXRLR       MRL           LL_I3C_SetMaxReadLength
  * @param  p_i3c I3C Instance.
  * @note   Those bits can be updated by HW upon reception of GETMRL CCC.
  * @param  max_read_length This parameter must be a value between Min_Data=0x0 and Max_Data=0xFFFF
  */
__STATIC_INLINE void LL_I3C_SetMaxReadLength(I3C_TypeDef *p_i3c, uint32_t max_read_length)
{
  STM32_MODIFY_REG(p_i3c->MAXRLR, I3C_MAXRLR_MRL, max_read_length);
}

/**
  * @brief  Return maximum read length (target mode).
  * @rmtoll
  *  MAXRLR       MRL           LL_I3C_GetMaxReadLength
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0x0 and Max_Data=0xFFFFF
  */
__STATIC_INLINE uint32_t LL_I3C_GetMaxReadLength(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->MAXRLR, I3C_MAXRLR_MRL));
}

/**
  * @brief  Configure the number of additional Mandatory data Byte (MDB) sent to the controller
  *         after an acknowledge of the IBI (target mode).
  * @rmtoll
  *  MAXRLR       IBIP          LL_I3C_ConfigNbIBIAddData
  * @param  p_i3c I3C Instance.
  * @param  nb_ibi_add_data This parameter can be one of the following values:
  *         @arg @ref LL_I3C_PAYLOAD_EMPTY << I3C_MAXRLR_IBIP_Pos
  *         @arg @ref LL_I3C_PAYLOAD_1_BYTE << I3C_MAXRLR_IBIP_Pos
  *         @arg @ref LL_I3C_PAYLOAD_2_BYTE << I3C_MAXRLR_IBIP_Pos
  *         @arg @ref LL_I3C_PAYLOAD_3_BYTE << I3C_MAXRLR_IBIP_Pos
  *         @arg @ref LL_I3C_PAYLOAD_4_BYTE << I3C_MAXRLR_IBIP_Pos
  */
__STATIC_INLINE void LL_I3C_ConfigNbIBIAddData(I3C_TypeDef *p_i3c, uint32_t nb_ibi_add_data)
{
  STM32_MODIFY_REG(p_i3c->MAXRLR, I3C_MAXRLR_IBIP, nb_ibi_add_data);
}

/**
  * @brief  Set the number of additional Mandatory data Byte (MDB) sent to the controller
  *         after an acknowledge of the IBI (target mode).
  *         I3C_MAXRLR_IBIP must be at reset value. It means after a block reset of the I3C Instance
  * @rmtoll
  *  MAXRLR       IBIP          LL_I3C_SetNbIBIAddData
  * @param  p_i3c I3C Instance.
  * @param  nb_ibi_add_data This parameter can be one of the following values:
  *         @arg @ref LL_I3C_PAYLOAD_EMPTY
  *         @arg @ref LL_I3C_PAYLOAD_1_BYTE
  *         @arg @ref LL_I3C_PAYLOAD_2_BYTE
  *         @arg @ref LL_I3C_PAYLOAD_3_BYTE
  *         @arg @ref LL_I3C_PAYLOAD_4_BYTE
  */
__STATIC_INLINE void LL_I3C_SetNbIBIAddData(I3C_TypeDef *p_i3c, uint32_t nb_ibi_add_data)
{
  STM32_SET_BIT(p_i3c->MAXRLR, nb_ibi_add_data);
}

/**
  * @brief  Return the number of additional Mandatory data Byte (MDB) sent to the controller
  *         after an acknowledge of the IBI (target mode).
  * @rmtoll
  *  MAXRLR       IBIP          LL_I3C_GetConfigNbIBIAddData
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_PAYLOAD_EMPTY
  *         @arg @ref LL_I3C_PAYLOAD_1_BYTE
  *         @arg @ref LL_I3C_PAYLOAD_2_BYTE
  *         @arg @ref LL_I3C_PAYLOAD_3_BYTE
  *         @arg @ref LL_I3C_PAYLOAD_4_BYTE
  */
__STATIC_INLINE uint32_t LL_I3C_GetConfigNbIBIAddData(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->MAXRLR, I3C_MAXRLR_IBIP));
}

/**
  * @brief  Configure maximum write length (target mode).
  * @rmtoll
  *  MAXWLR       MWL           LL_I3C_SetMaxWriteLength
  * @param  p_i3c I3C Instance.
  * @param  max_write_length_byte This parameter must be a value between Min_Data=0x0 and Max_Data=0xFFFF
  * @note   Those bits can be updated by HW upon reception of GETMWL CCC.
  */
__STATIC_INLINE void LL_I3C_SetMaxWriteLength(I3C_TypeDef *p_i3c, uint32_t max_write_length_byte)
{
  STM32_MODIFY_REG(p_i3c->MAXWLR, I3C_MAXWLR_MWL, max_write_length_byte);
}

/**
  * @brief  Return maximum write length (target mode).
  * @rmtoll
  *  MAXWLR       MWL           LL_I3C_GetMaxWriteLength
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0x0 and Max_Data=0xFFFFF
  */
__STATIC_INLINE uint32_t LL_I3C_GetMaxWriteLength(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->MAXWLR, I3C_MAXWLR_MWL));
}

/**
  * @brief  Configure the SCL clock signal waveform.
  * @rmtoll
  *  TIMINGR0     TIMINGR0      LL_I3C_ConfigClockWaveForm
  * @param  p_i3c I3C Instance.
  * @param  clock_wave_form This parameter must be a value between Min_Data=0 and Max_Data=0xFFFFFFFF.
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  *
  * @note   This parameter is computed with the STM32CubeMX Tool.
  */
__STATIC_INLINE void LL_I3C_ConfigClockWaveForm(I3C_TypeDef *p_i3c, uint32_t clock_wave_form)
{
  STM32_WRITE_REG(p_i3c->TIMINGR0, clock_wave_form);
}

/**
  * @brief  Get the SCL clock signal waveform.
  * @rmtoll
  *  TIMINGR0     TIMINGR0      LL_I3C_GetClockWaveForm
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0xFFFFFFFF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetClockWaveForm(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_REG(p_i3c->TIMINGR0));
}

/**
  * @brief  Configure the SCL clock low period during I3C push-pull phases.
  * @rmtoll
  *  TIMINGR0     SCLL_PP       LL_I3C_SetPeriodClockLowPP
  * @param  p_i3c I3C Instance.
  * @param  period_clock_low_pp This parameter must be a value between Min_Data=0 and Max_Data=0xFF.
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  * @note   This parameter is computed with the STM32CubeMX Tool.
  */
__STATIC_INLINE void LL_I3C_SetPeriodClockLowPP(I3C_TypeDef *p_i3c, uint32_t period_clock_low_pp)
{
  STM32_MODIFY_REG(p_i3c->TIMINGR0, I3C_TIMINGR0_SCLL_PP, (period_clock_low_pp << I3C_TIMINGR0_SCLL_PP_Pos));
}

/**
  * @brief  Get the SCL clock low period during I3C push-pull phases.
  * @rmtoll
  *  TIMINGR0     SCLL_PP       LL_I3C_GetPeriodClockLowPP
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0xFF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetPeriodClockLowPP(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->TIMINGR0, I3C_TIMINGR0_SCLL_PP) >> I3C_TIMINGR0_SCLL_PP_Pos);
}

/**
  * @brief  Configure the SCL clock High period during I3C open drain and push-pull phases.
  * @rmtoll
  *  TIMINGR0     SCLH_I3C      LL_I3C_SetPeriodClockHighI3C
  * @param  p_i3c I3C Instance.
  * @param  period_clock_high_i3c This parameter must be a value between Min_Data=0 and Max_Data=0xFF.
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  *
  * @note   This parameter is computed with the STM32CubeMX Tool.
  */
__STATIC_INLINE void LL_I3C_SetPeriodClockHighI3C(I3C_TypeDef *p_i3c, uint32_t period_clock_high_i3c)
{
  STM32_MODIFY_REG(p_i3c->TIMINGR0, I3C_TIMINGR0_SCLH_I3C, (period_clock_high_i3c << I3C_TIMINGR0_SCLH_I3C_Pos));
}

/**
  * @brief  Get the SCL clock high period during I3C open drain and push-pull phases.
  * @rmtoll
  *  TIMINGR0     SCLH_I3C      LL_I3C_GetPeriodClockHighI3C
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0xFF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetPeriodClockHighI3C(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->TIMINGR0, I3C_TIMINGR0_SCLH_I3C) >> I3C_TIMINGR0_SCLH_I3C_Pos);
}

/**
  * @brief  Configure the SCL clock low period during I3C open drain phases.
  * @rmtoll
  *  TIMINGR0     SCLL_OD       LL_I3C_SetPeriodClockLowOD
  * @param  p_i3c I3C Instance.
  * @param  period_clock_low_od This parameter must be a value between Min_Data=0 and Max_Data=0xFF.
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  * @note   This parameter is computed with the STM32CubeMX Tool.
  */
__STATIC_INLINE void LL_I3C_SetPeriodClockLowOD(I3C_TypeDef *p_i3c, uint32_t period_clock_low_od)
{
  STM32_MODIFY_REG(p_i3c->TIMINGR0, I3C_TIMINGR0_SCLL_OD, (period_clock_low_od << I3C_TIMINGR0_SCLL_OD_Pos));
}

/**
  * @brief  Get the SCL clock low period during I3C open phases.
  * @rmtoll
  *  TIMINGR0     SCLL_OD       LL_I3C_GetPeriodClockLowOD
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0xFF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetPeriodClockLowOD(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->TIMINGR0, I3C_TIMINGR0_SCLL_OD) >> I3C_TIMINGR0_SCLL_OD_Pos);
}

/**
  * @brief  Configure the SCL clock High period during I2C open drain phases.
  * @rmtoll
  *  TIMINGR0     SCLH_I2C      LL_I3C_SetPeriodClockHighI2C
  * @param  p_i3c I3C Instance.
  * @param  period_clock_high_i2c This parameter must be a value between Min_Data=0 and Max_Data=0xFF.
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  * @note   This parameter is computed with the STM32CubeMX Tool.
  */
__STATIC_INLINE void LL_I3C_SetPeriodClockHighI2C(I3C_TypeDef *p_i3c, uint32_t period_clock_high_i2c)
{
  STM32_MODIFY_REG(p_i3c->TIMINGR0, I3C_TIMINGR0_SCLH_I2C, period_clock_high_i2c << I3C_TIMINGR0_SCLH_I2C_Pos);
}

/**
  * @brief  Get the SCL clock high period during I2C open drain phases.
  * @rmtoll
  *  TIMINGR0     SCLH_I2C      LL_I3C_GetPeriodClockHighI2C
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0xFF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetPeriodClockHighI2C(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->TIMINGR0, I3C_TIMINGR0_SCLH_I2C) >> I3C_TIMINGR0_SCLH_I2C_Pos);
}

/**
  * @brief  Configure the controller additional hold time on SDA line.
  * @rmtoll
  *  TIMINGR1     SDA_HD        LL_I3C_SetDataHoldTime
  * @param  p_i3c I3C Instance.
  * @param  data_hold_time This parameter can be one of the following values:
  *         @arg @ref LL_I3C_SDA_HOLD_TIME_0_5
  *         @arg @ref LL_I3C_SDA_HOLD_TIME_1_5
  *         @arg @ref LL_I3C_SDA_HOLD_TIME_2_5
  *         @arg @ref LL_I3C_SDA_HOLD_TIME_3_5
  */
__STATIC_INLINE void LL_I3C_SetDataHoldTime(I3C_TypeDef *p_i3c, uint32_t data_hold_time)
{
  STM32_MODIFY_REG(p_i3c->TIMINGR1, I3C_TIMINGR1_SDA_HD, data_hold_time);
}

/**
  * @brief  Get the controller additional hold time on SDA line.
  * @rmtoll
  *  TIMINGR1     SDA_HD        LL_I3C_GetDataHoldTime
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_SDA_HOLD_TIME_0_5
  *         @arg @ref LL_I3C_SDA_HOLD_TIME_1_5
  *         @arg @ref LL_I3C_SDA_HOLD_TIME_2_5
  *         @arg @ref LL_I3C_SDA_HOLD_TIME_3_5
  */
__STATIC_INLINE uint32_t LL_I3C_GetDataHoldTime(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->TIMINGR1, I3C_TIMINGR1_SDA_HD));
}

/**
  * @brief  Configure the Idle, Available state.
  * @rmtoll
  *  TIMINGR1     AVAL          LL_I3C_SetAvalTiming
  * @param  p_i3c I3C Instance.
  * @param  aval_timing This parameter must be a value between Min_Data=0 and Max_Data=0xFF.
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  * @note   This parameter is computed with the STM32CubeMX Tool.
  */
__STATIC_INLINE void LL_I3C_SetAvalTiming(I3C_TypeDef *p_i3c, uint32_t aval_timing)
{
  STM32_MODIFY_REG(p_i3c->TIMINGR1, I3C_TIMINGR1_AVAL, (aval_timing << I3C_TIMINGR1_AVAL_Pos));
}

/**
  * @brief  Get the Idle, Available integer value state.
  * @rmtoll
  *  TIMINGR1     AVAL          LL_I3C_GetAvalTiming
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0xFF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetAvalTiming(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->TIMINGR1, I3C_TIMINGR1_AVAL) >> I3C_TIMINGR1_AVAL_Pos);
}

/**
  * @brief  Configure the Free state.
  * @rmtoll
  *  TIMINGR1     FREE          LL_I3C_SetFreeTiming
  * @param  p_i3c I3C Instance.
  * @param  free_timing This parameter must be a value between Min_Data=0 and Max_Data=0x3F.
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  * @note   This parameter is computed with the STM32CubeMX Tool.
  */
__STATIC_INLINE void LL_I3C_SetFreeTiming(I3C_TypeDef *p_i3c, uint32_t free_timing)
{
  STM32_MODIFY_REG(p_i3c->TIMINGR1, I3C_TIMINGR1_FREE, (free_timing << I3C_TIMINGR1_FREE_Pos));
}

/**
  * @brief  Get the free integer value state.
  * @rmtoll
  *  TIMINGR1     FREE          LL_I3C_GetFreeTiming
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0x3F.
  */
__STATIC_INLINE uint32_t LL_I3C_GetFreeTiming(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->TIMINGR1, I3C_TIMINGR1_FREE) >> I3C_TIMINGR1_FREE_Pos);
}

