MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i3c.h
/**
  * @brief  Configure the activity state of the new controller.
  * @rmtoll
  *  TIMINGR1     ASNCR            LL_I3C_SetControllerActivityState
  * @param  p_i3c I3C Instance.
  * @param  controller_activity_state This parameter can be one of the following values:
  *         @arg @ref LL_I3C_OWN_ACTIVITY_STATE_0
  *         @arg @ref LL_I3C_OWN_ACTIVITY_STATE_1
  *         @arg @ref LL_I3C_OWN_ACTIVITY_STATE_2
  *         @arg @ref LL_I3C_OWN_ACTIVITY_STATE_3
  * @note   Refer to MIPI I3C specification (https:__www.mipi.org_specifications)
  *         for more details related to activity state.
  */
__STATIC_INLINE void LL_I3C_SetControllerActivityState(I3C_TypeDef *p_i3c, uint32_t controller_activity_state)
{
  STM32_MODIFY_REG(p_i3c->TIMINGR1, I3C_TIMINGR1_ASNCR, controller_activity_state);
}

/**
  * @brief  Get the activity state of the new controller.
  * @rmtoll
  *  TIMINGR1     ASNCR            LL_I3C_GetControllerActivityState
  * @param  p_i3c I3C Instance.
  * @note   Refer to MIPI I3C specification (https:__www.mipi.org_specifications)
  *         for more details related to activity state.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_OWN_ACTIVITY_STATE_0
  *         @arg @ref LL_I3C_OWN_ACTIVITY_STATE_1
  *         @arg @ref LL_I3C_OWN_ACTIVITY_STATE_2
  *         @arg @ref LL_I3C_OWN_ACTIVITY_STATE_3
  */
__STATIC_INLINE uint32_t LL_I3C_GetControllerActivityState(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->TIMINGR1, I3C_TIMINGR1_ASNCR));
}


/**
  * @brief  Configure the controller SDA hold time, Bus Free, Activity state, Idle state.
  * @rmtoll
  *  TIMINGR1     SDA_HD        LL_I3C_SetBusCharacteristic \n
  *  TIMINGR1     FREE          LL_I3C_SetBusCharacteristic \n
  *  TIMINGR1     ASNCR         LL_I3C_SetBusCharacteristic \n
  *  TIMINGR1     AVAL          LL_I3C_SetBusCharacteristic
  * @param  p_i3c I3C Instance.
  * @param  ctrl_bus_characteristic This parameter must be a value between Min_Data=0 and Max_Data=0x107F03FF.
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  *
  * @note   This parameter is computed with the STM32CubeMX Tool.
  */
__STATIC_INLINE void LL_I3C_SetBusCharacteristic(I3C_TypeDef *p_i3c, uint32_t ctrl_bus_characteristic)
{
  STM32_WRITE_REG(p_i3c->TIMINGR1, ctrl_bus_characteristic);
}

/**
  * @brief  Get the controller SDA hold time, Bus Free, Activity state, Idle state.
  * @rmtoll
  *  TIMINGR1     SDA_HD        LL_I3C_GetBusCharacteristic \n
  *  TIMINGR1     FREE          LL_I3C_GetBusCharacteristic \n
  *  TIMINGR1     ASNCR         LL_I3C_GetBusCharacteristic \n
  *  TIMINGR1     AVAL          LL_I3C_GetBusCharacteristic
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0x107F03FF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetBusCharacteristic(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_REG(p_i3c->TIMINGR1));
}


/**
  * @brief  Configure the controller SDA hold time, Bus Free, Activity state, Idle state.
  * @rmtoll
  *  TIMINGR1     SDA_HD        LL_I3C_SetCtrlBusCharacteristic \n
  *  TIMINGR1     FREE          LL_I3C_SetCtrlBusCharacteristic \n
  *  TIMINGR1     ASNCR         LL_I3C_SetCtrlBusCharacteristic \n
  *  TIMINGR1     IDLE          LL_I3C_SetCtrlBusCharacteristic
  * @param  p_i3c I3C Instance.
  * @param  ctrl_bus_characteristic This parameter must be a value between Min_Data=0 and Max_Data=0x107F03FF.
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  *
  * @note   This parameter is computed with the STM32CubeMX Tool.
  */
__STATIC_INLINE void LL_I3C_SetCtrlBusCharacteristic(I3C_TypeDef *p_i3c, uint32_t ctrl_bus_characteristic)
{
  STM32_WRITE_REG(p_i3c->TIMINGR1, ctrl_bus_characteristic);
}

/**
  * @brief  Get the controller SDA hold time, Bus Free, Activity state, Idle state.
  * @rmtoll
  *  TIMINGR1     SDA_HD        LL_I3C_GetCtrlBusCharacteristic \n
  *  TIMINGR1     FREE          LL_I3C_GetCtrlBusCharacteristic \n
  *  TIMINGR1     ASNCR         LL_I3C_GetCtrlBusCharacteristic \n
  *  TIMINGR1     IDLE          LL_I3C_GetCtrlBusCharacteristic
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0x107F03FF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetCtrlBusCharacteristic(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_REG(p_i3c->TIMINGR1));
}

/**
  * @brief  Configure the target available state.
  * @rmtoll
  *  TIMINGR1     IDLE          LL_I3C_SetTgtBusCharacteristic
  * @param  p_i3c I3C Instance.
  * @param  tgt_bus_characteristic This parameter must be a value between Min_Data=0 and Max_Data=0xFF.
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  *
  * @note   This parameter is computed with the STM32CubeMX Tool.
  */
__STATIC_INLINE void LL_I3C_SetTgtBusCharacteristic(I3C_TypeDef *p_i3c, uint32_t tgt_bus_characteristic)
{
  STM32_MODIFY_REG(p_i3c->TIMINGR1, I3C_TIMINGR1_AVAL, (tgt_bus_characteristic & I3C_TIMINGR1_AVAL));
}

/**
  * @brief  Get the target available state.
  * @rmtoll
  *  TIMINGR1     IDLE          LL_I3C_GetTgtBusCharacteristic
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0xFF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetTgtBusCharacteristic(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->TIMINGR1, I3C_TIMINGR1_AVAL));
}

/**
  * @brief  Set the SCL clock stalling configuration. All stall features not selected are disabled.
  * @param  hi3c  Pointer to a hal_i3c_handle_t
  * @param  stall_time_cycle Controller clock stall time in number of kernel clock cycles.
            This parameter must be a number between Min_Data=0x00 and Max_Data=0xFF.
  * @param  stall_features Features of the I3C controller to which the stall time will be applied.
            See @ref I3C_CTRL_STALL_FEATURE_DEFINITION, this parameter is a combination of the following values:
              @ref LL_I3C_CTRL_STALL_ACK
              @ref LL_I3C_CTRL_STALL_CCC
              @ref LL_I3C_CTRL_STALL_TX
              @ref LL_I3C_CTRL_STALL_RX
              @ref LL_I3C_CTRL_STALL_I2C_ACK
              @ref LL_I3C_CTRL_STALL_I2C_TX
              @ref LL_I3C_CTRL_STALL_I2C_RX
              @ref LL_I3C_CTRL_STALL_ALL
              @ref LL_I3C_CTRL_STALL_NONE
  * @note   This configuration can be set when the I3C is acting as controller.
  */
__STATIC_INLINE void LL_I3C_ConfigStallTime(I3C_TypeDef *p_i3c, uint32_t stall_time_cycle, uint32_t stall_features)
{
  STM32_WRITE_REG(p_i3c->TIMINGR2, (((uint32_t) stall_time_cycle << I3C_TIMINGR2_STALL_Pos) | stall_features));
}

/**
  * @brief  Configure the SCL clock stalling time on I3C Bus (controller mode).
  * @rmtoll
  *  TIMINGR2     STALL        LL_I3C_SetStallTime
  * @param  p_i3c I3C Instance.
  * @param  ctrl_stall_time This parameter must be a value between Min_Data=0 and Max_Data=0xFF.
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  *
  * @note   This parameter is computed with the STM32CubeMX Tool.
  */
__STATIC_INLINE void LL_I3C_SetStallTime(I3C_TypeDef *p_i3c, uint32_t ctrl_stall_time)
{
  STM32_MODIFY_REG(p_i3c->TIMINGR2, I3C_TIMINGR2_STALL, (ctrl_stall_time << I3C_TIMINGR2_STALL_Pos));
}

/**
  * @brief  Get the SCL clock stalling time on I3C Bus (controller mode).
  * @rmtoll
  *  TIMINGR2     STALL        LL_I3C_GetStallTime
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0xFF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetStallTime(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALL));
}

/**
  * @brief  Set stall on data ACK/NACK bit of legacy I2C address (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLL       LL_I3C_EnableStallACKI2CAddr
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_EnableStallACKI2CAddr(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLL);
}

/**
  * @brief  Disable stall on data ACK/NACK bit of legacy I2C address (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLA       LL_I3C_DisableStallACKI2CAddr
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_DisableStallACKI2CAddr(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLL);
}

/**
  * @brief  Check if stall on data ACK/NACK bit of legacy I2C address is enabled or disabled (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLA       LL_I3C_IsEnabledStallACKI2CAddr
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledStallACKI2CAddr(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLL) == (I3C_TIMINGR2_STALLL)) ? 1UL : 0UL);
}

/**
  * @brief  Set stall on data ACK/NACK bit of legacy I2C write message (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLS       LL_I3C_EnableStallACKI2CWrite
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_EnableStallACKI2CWrite(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLS);
}

/**
  * @brief  Disable stall on data ACK/NACK bit of legacy I2C write message (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLS       LL_I3C_DisableStallACKI2CWrite
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_DisableStallACKI2CWrite(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLS);
}

/**
  * @brief  Check if stall on data ACK/NACK bit of legacy I2C write message is enabled or disabled (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLS       LL_I3C_IsEnabledStallACKI2CWrite
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledStallACKI2CWrite(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLS) == (I3C_TIMINGR2_STALLS)) ? 1UL : 0UL);
}

/**
  * @brief  Set stall on data ACK/NACK bit of legacy I2C read message (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLR       LL_I3C_EnableStallACKI2CRead
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_EnableStallACKI2CRead(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLR);
}

/**
  * @brief  Disable stall on data ACK/NACK bit of legacy I2C read message (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLR       LL_I3C_DisableStallACKI2CRead
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_DisableStallACKI2CRead(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLR);
}

/**
  * @brief  Check if stall on data ACK/NACK bit of legacy I2C read message is enabled or disabled (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLR       LL_I3C_IsEnabledStallACKI2CRead
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledStallACKI2CRead(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLR) == (I3C_TIMINGR2_STALLR)) ? 1UL : 0UL);
}

/**
  * @brief  Set stall on ACK bit (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLA       LL_I3C_EnableStallACK
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_EnableStallACK(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLA);
}

/**
  * @brief  Disable stall on ACK bit (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLA       LL_I3C_DisableStallACK
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_DisableStallACK(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLA);
}

/**
  * @brief  Check if stall on ACK bit is enabled or disabled (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLA       LL_I3C_IsEnabledStallACK
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledStallACK(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLA) == (I3C_TIMINGR2_STALLA)) ? 1UL : 0UL);
}

/**
  * @brief  Set stall on Parity bit of command Code byte (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLC       LL_I3C_EnableStallParityCCC
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_EnableStallParityCCC(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLC);
}

/**
  * @brief  Disable stall on Parity bit of command Code byte (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLC       LL_I3C_DisableStallParityCCC
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_DisableStallParityCCC(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLC);
}

/**
  * @brief  Check if stall on Parity bit of command Code byte is enabled or disabled (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLC       LL_I3C_IsEnabledStallParityCCC
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledStallParityCCC(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLC) == (I3C_TIMINGR2_STALLC)) ? 1UL : 0UL);
}

/**
  * @brief  Set stall on Parity bit of data bytes (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLD       LL_I3C_EnableStallParityData
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_EnableStallParityData(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLD);
}

/**
  * @brief  Disable stall on Parity bit of data bytes (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLD       LL_I3C_DisableStallParityData
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_DisableStallParityData(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLD);
}

/**
  * @brief  Check if stall on Parity bit of data bytes is enabled or disabled (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLD       LL_I3C_IsEnabledStallParityData
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledStallParityData(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLD) == (I3C_TIMINGR2_STALLD)) ? 1UL : 0UL);
}

/**
  * @brief  Set stall on T bit (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLT       LL_I3C_EnableStallTbit
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_EnableStallTbit(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLT);
}

/**
  * @brief  Disable stall on T bit (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLT       LL_I3C_DisableStallTbit
  * @param  p_i3c I3C Instance.
  * @note   This bit can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_DisableStallTbit(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLT);
}

/**
  * @brief  Check if stall on T bit is enabled or disabled (controller mode).
  * @rmtoll
  *  TIMINGR2     STALLT       LL_I3C_IsEnabledStallTbit
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledStallTbit(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->TIMINGR2, I3C_TIMINGR2_STALLT) == (I3C_TIMINGR2_STALLT)) ? 1UL : 0UL);
}

/**
  * @brief   Set control capability, IBI payload support and max speed limitation in BCR register.
  * @rmtoll
  *  BCR     BCR      LL_I3C_ConfigPayloadEntDAA
  * @param  p_i3c I3C Instance.
  * @param  max_data_speed_limitation This parameter can be one of the following values:
  *         @arg @ref LL_I3C_NO_DATA_SPEED_LIMITATION
  *         @arg @ref LL_I3C_MAX_DATA_SPEED_LIMITATION
  * @param  ibi_payload This parameter can be one of the following values:
  *         @arg @ref LL_I3C_IBI_NO_ADDITIONAL_DATA
  *         @arg @ref LL_I3C_IBI_ADDITIONAL_DATA
  * @param  ctrl_role This parameter can be one of the following values:
  *         @arg @ref LL_I3C_DEVICE_ROLE_AS_TARGET
  *         @arg @ref LL_I3C_DEVICE_ROLE_AS_CONTROLLER
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_ConfigPayloadEntDAA(I3C_TypeDef *p_i3c, uint32_t  max_data_speed_limitation,
                                                uint32_t ibi_payload, uint32_t  ctrl_role)
{
  STM32_WRITE_REG(p_i3c->BCR, max_data_speed_limitation | ibi_payload  | ctrl_role);
}

/**
  * @brief  Configure the device capability on bus as target or controller (MIPI Bus Characteristics Register BCR6).
  * @rmtoll
  *  BCR          BCR6          LL_I3C_SetDeviceCapabilityOnBus
  * @param  p_i3c I3C Instance.
  * @param  device_capability_on_bus This parameter can be one of the following values:
  *         @arg @ref LL_I3C_DEVICE_ROLE_AS_TARGET
  *         @arg @ref LL_I3C_DEVICE_ROLE_AS_CONTROLLER
  * @note   Those bits can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_SetDeviceCapabilityOnBus(I3C_TypeDef *p_i3c, uint32_t device_capability_on_bus)
{
  STM32_MODIFY_REG(p_i3c->BCR, I3C_BCR_BCR6, device_capability_on_bus);
}

/**
  * @brief  Get the device capability on bus as target or controller (MIPI Bus Characteristics Register BCR6).
  * @rmtoll
  *  BCR          BCR6          LL_I3C_GetDeviceCapabilityOnBus
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_DEVICE_ROLE_AS_TARGET
  *         @arg @ref LL_I3C_DEVICE_ROLE_AS_CONTROLLER
  */
__STATIC_INLINE uint32_t LL_I3C_GetDeviceCapabilityOnBus(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->BCR, I3C_BCR_BCR6));
}

/**
  * @brief  Configure the device IBI payload (MIPI Bus Characteristics Register BCR2).
  * @rmtoll
  *  BCR          BCR2          LL_I3C_SetDeviceIBIPayload
  * @param  p_i3c I3C Instance.
  * @param  device_ibi_payload This parameter can be one of the following values:
  *         @arg @ref LL_I3C_IBI_NO_ADDITIONAL_DATA
  *         @arg @ref LL_I3C_IBI_ADDITIONAL_DATA
  * @note   Those bits can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_SetDeviceIBIPayload(I3C_TypeDef *p_i3c, uint32_t device_ibi_payload)
{
  STM32_MODIFY_REG(p_i3c->BCR, I3C_BCR_BCR2, device_ibi_payload);
}

/**
  * @brief  Get the device IBI payload (MIPI Bus Characteristics Register BCR2).
  * @rmtoll
  *  BCR          BCR2          LL_I3C_GetDeviceIBIPayload
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_IBI_NO_ADDITIONAL_DATA
  *         @arg @ref LL_I3C_IBI_ADDITIONAL_DATA
  */
__STATIC_INLINE uint32_t LL_I3C_GetDeviceIBIPayload(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->BCR, I3C_BCR_BCR2));
}

/**
  * @brief  Configure the data Speed Limitation (limitation, as described by I3C_GETMXDSR).
  * @rmtoll
  *  BCR          BCR0          LL_I3C_SetDataSpeedLimitation
  * @param  p_i3c I3C Instance.
  * @param  data_speed_limitation This parameter can be one of the following values:
  *         @arg @ref LL_I3C_NO_DATA_SPEED_LIMITATION
  *         @arg @ref LL_I3C_MAX_DATA_SPEED_LIMITATION
  * @note   Those bits can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_SetDataSpeedLimitation(I3C_TypeDef *p_i3c, uint32_t data_speed_limitation)
{
  STM32_MODIFY_REG(p_i3c->BCR, I3C_BCR_BCR0, data_speed_limitation);
}

/**
  * @brief  Get  the data Speed Limitation (limitation, as described by I3C_GETMXDSR).
  * @rmtoll
  *  BCR          BCR0          LL_I3C_GetDataSpeedLimitation
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_NO_DATA_SPEED_LIMITATION
  *         @arg @ref LL_I3C_MAX_DATA_SPEED_LIMITATION
  */
__STATIC_INLINE uint32_t LL_I3C_GetDataSpeedLimitation(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->BCR, I3C_BCR_BCR0));
}

/**
  * @brief  Configure the device Characteristics Register (DCR).
  * @rmtoll
  *  DCR          DC            LL_I3C_SetDeviceCharacteristics
  * @param  p_i3c I3C Instance.
  * @param  device_characteristics This parameter must be a value between Min_Data=0 and Max_Data=0xFF.
  * @note   This bit can only be programmed when the I3C is disabled (EN = 0).
  *
  * @note   Refer MIPI web site for the list of device code available.
  */
__STATIC_INLINE void LL_I3C_SetDeviceCharacteristics(I3C_TypeDef *p_i3c, uint32_t device_characteristics)
{
  STM32_MODIFY_REG(p_i3c->DCR, I3C_DCR_DCR, device_characteristics);
}

/**
  * @brief  Get the device Characteristics Register (DCR).
  * @rmtoll
  *  DCR          DCR            LL_I3C_GetDeviceCharacteristics
  * @param  p_i3c I3C Instance.
  * @note   Refer MIPI web site to associated value with the list of device code available.
  * @retval Value between Min_Data=0 and Max_Data=0xFF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetDeviceCharacteristics(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->DCR, I3C_DCR_DCR));
}

/**
  * @brief  Configure IBI MDB support for pending read notification.
  * @rmtoll
  *  GETCAPR     CAPPEND          LL_I3C_SetPendingReadMDB
  * @param  p_i3c I3C Instance.
  * @param  pending_read_mdb This parameter can be one of the following values:
  *         @arg @ref LL_I3C_MDB_NO_PENDING_READ_NOTIFICATION
  *         @arg @ref LL_I3C_MDB_PENDING_READ_NOTIFICATION
  * @note   Those bits can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_SetPendingReadMDB(I3C_TypeDef *p_i3c, uint32_t pending_read_mdb)
{
  STM32_MODIFY_REG(p_i3c->GETCAPR, I3C_GETCAPR_CAPPEND, pending_read_mdb);
}

/**
  * @brief  Enable IBI MDB support for pending read notification.
  * @rmtoll
  *  GETCAPR     CAPPEND          LL_I3C_EnablePendingReadMDB
  * @param  p_i3c I3C Instance.
  * @note   Those bits can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_EnablePendingReadMDB(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->GETCAPR, I3C_GETCAPR_CAPPEND);
}


/**
  * @brief  Get IBI MDB support for pending read notification value.
  * @rmtoll
  *  GETCAPR     CAPPEND          LL_I3C_GetPendingReadMDB
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_MDB_NO_PENDING_READ_NOTIFICATION
  *         @arg @ref LL_I3C_MDB_PENDING_READ_NOTIFICATION
  */
__STATIC_INLINE uint32_t LL_I3C_GetPendingReadMDB(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->GETCAPR, I3C_GETCAPR_CAPPEND));
}

