MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i3c.h
/**
  * @brief  Configure the Group Management Support bit of MSTCAP1.
  * @rmtoll
  *  CRCAPR      CAPGRP        LL_I3C_SetGrpAddrHandoffSupport
  * @param  p_i3c I3C Instance.
  * @param  grp_addr_handoff_support This parameter can be one of the following values:
  *         @arg @ref LL_I3C_HANDOFF_GRP_ADDR_NOT_SUPPORTED
  *         @arg @ref LL_I3C_HANDOFF_GRP_ADDR_SUPPORTED
  * @note   Those bits can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_SetGrpAddrHandoffSupport(I3C_TypeDef *p_i3c, uint32_t grp_addr_handoff_support)
{
  STM32_MODIFY_REG(p_i3c->CRCAPR, I3C_CRCAPR_CAPGRP, grp_addr_handoff_support);
}

/**
  * @brief  Get the Group Management Support bit of MSTCAP1.
  * @rmtoll
  *  CRCAPR      CAPGRP        LL_I3C_GetGrpAddrHandoffSupport
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_HANDOFF_GRP_ADDR_NOT_SUPPORTED
  *         @arg @ref LL_I3C_HANDOFF_GRP_ADDR_SUPPORTED
  */
__STATIC_INLINE uint32_t LL_I3C_GetGrpAddrHandoffSupport(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->CRCAPR, I3C_CRCAPR_CAPGRP));
}

/**
  * @brief  Configure the Delayed controller Handoff bit in MSTCAP2.
  * @rmtoll
  *  CRCAPR      CAPDHOFF      LL_I3C_SetControllerHandoffDelayed
  * @param  p_i3c I3C Instance.
  * @param  controller_handoff_delayed This parameter can be one of the following values:
  *         @arg @ref LL_I3C_HANDOFF_NOT_DELAYED
  *         @arg @ref LL_I3C_HANDOFF_DELAYED
  * @note   Those bits can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_SetControllerHandoffDelayed(I3C_TypeDef *p_i3c, uint32_t controller_handoff_delayed)
{
  STM32_MODIFY_REG(p_i3c->CRCAPR, I3C_CRCAPR_CAPDHOFF, controller_handoff_delayed);
}

/**
  * @brief  Get the Delayed controller Handoff bit in MSTCAP2.
  * @rmtoll
  *  CRCAPR      CAPDHOFF      LL_I3C_GetControllerHandoffDelayed
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_HANDOFF_NOT_DELAYED
  *         @arg @ref LL_I3C_HANDOFF_DELAYED
  */
__STATIC_INLINE uint32_t LL_I3C_GetControllerHandoffDelayed(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->CRCAPR, I3C_CRCAPR_CAPDHOFF));
}

/**
  * @brief  Enable the Delayed controller Handoff bit in MSTCAP2.
  * @rmtoll
  *  CRCAPR      CAPDHOFF      LL_I3C_EnableHandOffDelay
  * @param  p_i3c I3C Instance.
  * @note   Those bits can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_EnableHandOffDelay(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CRCAPR, I3C_CRCAPR_CAPDHOFF);
}

/**
  * @brief  Disable the Delayed controller Handoff bit in MSTCAP2.
  * @rmtoll
  *  CRCAPR      CAPDHOFF      LL_I3C_DisableHandOffDelay
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableHandOffDelay(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->CRCAPR, I3C_CRCAPR_CAPDHOFF);
}

/**
  * @brief  Indicates if the Delayed controller Handoff bit in MSTCAP2 is enabled.
  *         RESET: IBI not Acknowledged.
  *         SET: IBI Acknowledged.
  * @rmtoll
  *  CRCAPR      CAPDHOFF        LL_I3C_IsEnabledHandOffDelay
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledHandOffDelay(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->CRCAPR, I3C_CRCAPR_CAPDHOFF) == I3C_CRCAPR_CAPDHOFF) ? 1UL : 0UL);
}

/**
  * @brief  Configure GETMXDS response fields.
  * @rmtoll
  *  GETMXDSR  HOFFAS,FMT,TSCO,RDTURN  LL_I3C_SetConfigGETMXDS
  * @param  p_i3c I3C Instance.
  * @param  ctrl_handoff_activity One of @ref LL_I3C_HANDOFF_ACTIVITY_STATE_0..3 (HOFFAS bits).
  * @param  getmxds_format One of @ref LL_I3C_GETMXDS_FORMAT_1 / _2_LSB / _2_MID / _2_MSB (FMT bits).
  * @param  data_turnaround_duration One of @ref LL_I3C_TURNAROUND_TIME_TSCO_LESS_12NS or
  *         @ref LL_I3C_TURNAROUND_TIME_TSCO_GREATER_12NS (TSCO bit).
  * @param  max_read_turnaround Value 0..0xF placed in RDTURN[3:0] (only used for format 2 variants).
  * @note   Programmable only when EN = 0.
  */
__STATIC_INLINE void LL_I3C_SetConfigGETMXDS(I3C_TypeDef *p_i3c,
                                             uint32_t ctrl_handoff_activity,
                                             uint32_t getmxds_format,
                                             uint32_t data_turnaround_duration,
                                             uint32_t max_read_turnaround)
{
  uint32_t getmxdsr_value = (ctrl_handoff_activity |
                             getmxds_format |
                             data_turnaround_duration |
                             ((uint32_t)max_read_turnaround << I3C_GETMXDSR_RDTURN_Pos));
  STM32_WRITE_REG(p_i3c->GETMXDSR, getmxdsr_value);
}

/**
  * @brief  Configure the activity state after controllership handoff.
  * @rmtoll
  *  GETMXDSR     HOFFAS        LL_I3C_SetHandoffActivityState
  * @param  p_i3c I3C Instance.
  * @param  handoff_activity_state This parameter can be one of the following values:
  *         @arg @ref LL_I3C_HANDOFF_ACTIVITY_STATE_0
  *         @arg @ref LL_I3C_HANDOFF_ACTIVITY_STATE_1
  *         @arg @ref LL_I3C_HANDOFF_ACTIVITY_STATE_2
  *         @arg @ref LL_I3C_HANDOFF_ACTIVITY_STATE_3
  * @note   Those bits can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_SetHandoffActivityState(I3C_TypeDef *p_i3c, uint32_t handoff_activity_state)
{
  STM32_MODIFY_REG(p_i3c->GETMXDSR, I3C_GETMXDSR_HOFFAS, handoff_activity_state);
}

/**
  * @brief  Get the activity state after controllership handoff.
  * @rmtoll
  *  GETMXDSR     HOFFAS        LL_I3C_GetHandoffActivityState
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_HANDOFF_ACTIVITY_STATE_0
  *         @arg @ref LL_I3C_HANDOFF_ACTIVITY_STATE_1
  *         @arg @ref LL_I3C_HANDOFF_ACTIVITY_STATE_2
  *         @arg @ref LL_I3C_HANDOFF_ACTIVITY_STATE_3
  */
__STATIC_INLINE uint32_t LL_I3C_GetHandoffActivityState(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->GETMXDSR, I3C_GETMXDSR_HOFFAS));
}

/**
  * @brief  Configure the max data speed format response for GETMXDS CCC.
  * @rmtoll
  *  GETMXDSR     FMT          LL_I3C_SetMaxDataSpeedFormat
  * @param  p_i3c I3C Instance.
  * @param  max_data_speed_format This parameter can be one of the following values:
  *         @arg @ref LL_I3C_GETMXDS_FORMAT_1
  *         @arg @ref LL_I3C_GETMXDS_FORMAT_2_LSB
  *         @arg @ref LL_I3C_GETMXDS_FORMAT_2_MID
  *         @arg @ref LL_I3C_GETMXDS_FORMAT_2_MSB
  * @note   Those bits can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_SetMaxDataSpeedFormat(I3C_TypeDef *p_i3c, uint32_t max_data_speed_format)
{
  STM32_MODIFY_REG(p_i3c->GETMXDSR, I3C_GETMXDSR_FMT, max_data_speed_format);
}

/**
  * @brief  Get the max data Speed format response for GETMXDS CCC.
  * @rmtoll
  *  GETMXDSR     FMT          LL_I3C_GetMaxDataSpeedFormat
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_GETMXDS_FORMAT_1
  *         @arg @ref LL_I3C_GETMXDS_FORMAT_2_LSB
  *         @arg @ref LL_I3C_GETMXDS_FORMAT_2_MID
  *         @arg @ref LL_I3C_GETMXDS_FORMAT_2_MSB
  */
__STATIC_INLINE uint32_t LL_I3C_GetMaxDataSpeedFormat(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->GETMXDSR, I3C_GETMXDSR_FMT));
}

/**
  * @brief  Configure the middle byte of MaxRdTurn field of GETMXDS CCC format 2 with turnaround.
  * @rmtoll
  *  GETMXDSR     RDTURN        LL_I3C_SetMiddleByteTurnAround
  * @param  p_i3c I3C Instance.
  * @param  middle_byte_turn_around This parameter must be a value between Min_Data=0 and Max_Data=0xF.
  * @note   Those bits can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_SetMiddleByteTurnAround(I3C_TypeDef *p_i3c, uint32_t middle_byte_turn_around)
{
  STM32_MODIFY_REG(p_i3c->GETMXDSR, I3C_GETMXDSR_RDTURN, (middle_byte_turn_around << I3C_GETMXDSR_RDTURN_Pos));
}

/**
  * @brief  Get the value of middle byte of MaxRdTurn field of GETMXDS CCC format 2 with turnaround.
  * @rmtoll
  *  GETMXDSR     RDTURN        LL_I3C_GetMiddleByteTurnAround
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0xF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetMiddleByteTurnAround(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->GETMXDSR, I3C_GETMXDSR_RDTURN));
}

/**
  * @brief  Configure clock-to-data turnaround time.
  * @rmtoll
  *  GETMXDSR     TSCO          LL_I3C_SetDataTurnAroundTime
  * @param  p_i3c I3C Instance.
  * @param  data_turn_around_time This parameter can be one of the following values:
  *         @arg @ref LL_I3C_TURNAROUND_TIME_TSCO_LESS_12NS
  *         @arg @ref LL_I3C_TURNAROUND_TIME_TSCO_GREATER_12NS
  * @note   Those bits can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_SetDataTurnAroundTime(I3C_TypeDef *p_i3c, uint32_t data_turn_around_time)
{
  STM32_MODIFY_REG(p_i3c->GETMXDSR, I3C_GETMXDSR_TSCO, data_turn_around_time);
}

/**
  * @brief  Get clock-to-data turnaround time.
  * @rmtoll
  *  GETMXDSR     TSCO          LL_I3C_GetDataTurnAroundTime
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_TURNAROUND_TIME_TSCO_LESS_12NS
  *         @arg @ref LL_I3C_TURNAROUND_TIME_TSCO_GREATER_12NS
  */
__STATIC_INLINE uint32_t LL_I3C_GetDataTurnAroundTime(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->GETMXDSR, I3C_GETMXDSR_TSCO));
}

/**
  * @brief  Configure the MIPI Instance ID.
  * @rmtoll
  *  EPIDR        MIPIID       LL_I3C_SetMIPIInstanceID
  * @param  p_i3c I3C Instance.
  * @param  mipi_instance_id This parameter must be a value between Min_Data=0 and Max_Data=0xF.
  * @note   Those bits can be programmed when the I3C is disabled (EN = 0).
  */
__STATIC_INLINE void LL_I3C_SetMIPIInstanceID(I3C_TypeDef *p_i3c, uint32_t mipi_instance_id)
{
  STM32_MODIFY_REG(p_i3c->EPIDR, I3C_EPIDR_MIPIID, (mipi_instance_id << I3C_EPIDR_MIPIID_Pos));
}

/**
  * @brief  Get the MIPI Instance ID.
  * @rmtoll
  *  EPIDR        MIPIID       LL_I3C_GetMIPIInstanceID
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0xF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetMIPIInstanceID(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->EPIDR, I3C_EPIDR_MIPIID) >> I3C_EPIDR_MIPIID_Pos);
}

/**
  * @brief  Get the ID type selector.
  * @rmtoll
  *  EPIDR        IDTSEL        LL_I3C_GetIDTypeSelector
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0x0 and Max_Data=0x1
  */
__STATIC_INLINE uint32_t LL_I3C_GetIDTypeSelector(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->EPIDR, I3C_EPIDR_IDTSEL) >> I3C_EPIDR_IDTSEL_Pos);
}

/**
  * @brief  Get the MIPI Manufacturer ID.
  * @rmtoll
  *  EPIDR        MIPIMID       LL_I3C_GetMIPIManufacturerID
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 and Max_Data=0x7FFF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetMIPIManufacturerID(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->EPIDR, I3C_EPIDR_MIPIMID) >> I3C_EPIDR_MIPIMID_Pos);
}

/**
  * @}
  */

/** @defgroup I3C_LL_EF_Data Management
  * @{
  */

/**
  * @brief  Request a reception data FIFO flush.
  * @rmtoll
  *  CFGR      RXFLUSH       LL_I3C_RequestRxFIFOFlush
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_RequestRxFIFOFlush(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_RXFLUSH);
}

/**
  * @brief  Request a transmission data FIFO Flush.
  * @rmtoll
  *  CFGR      TXFLUSH       LL_I3C_RequestTxFIFOFlush
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_RequestTxFIFOFlush(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_TXFLUSH);
}

/**
  * @brief  Request a status data FIFO Flush.
  * @rmtoll
  *  CFGR      SFLUSH        LL_I3C_RequestStatusFIFOFlush
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_RequestStatusFIFOFlush(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_SFLUSH);
}

/**
  * @brief  Set End of Frame mode.
  * @rmtoll
  *  CFGR      FCFDIS        LL_I3C_SetEndOfFrameMode
  * @param  p_i3c I3C Instance.
  * @param  eof_frame_config This parameter can be one of the following values:
  *         @arg @ref LL_I3C_END_OF_FRAME_CPLT_DISABLE
  *         @arg @ref LL_I3C_END_OF_FRAME_CPLT_ENABLE
  * @note   This bit can be modified only when there is no frame ongoing
  */
__STATIC_INLINE void LL_I3C_SetEndOfFrameMode(I3C_TypeDef *p_i3c, uint32_t eof_frame_config)
{
  STM32_MODIFY_REG(p_i3c->CFGR, I3C_CFGR_FCFDIS, eof_frame_config);
}

/**
  * @brief  Get End of Frame mode.
  * @rmtoll
  *  CFGR      FCFDIS        LL_I3C_GetEndOfFrameMode
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_END_OF_FRAME_CPLT_DISABLE
  *         @arg @ref LL_I3C_END_OF_FRAME_CPLT_ENABLE
  */
__STATIC_INLINE uint32_t LL_I3C_GetEndOfFrameMode(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->CFGR, I3C_CFGR_FCFDIS));
}

/**
  * @brief  Get activity state of controller on the I3C Bus (target only).
  * @rmtoll
  *  DEVR0        AS            LL_I3C_GetActivityState
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_BUS_ACTIVITY_STATE_0
  *         @arg @ref LL_I3C_BUS_ACTIVITY_STATE_1
  *         @arg @ref LL_I3C_BUS_ACTIVITY_STATE_2
  *         @arg @ref LL_I3C_BUS_ACTIVITY_STATE_3
  */
__STATIC_INLINE uint32_t LL_I3C_GetActivityState(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->DEVR0, I3C_DEVR0_AS));
}

/**
  * @brief  Get reset action (target only).
  * @rmtoll
  *  DEVR0        RSTACT        LL_I3C_GetResetAction
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_RESET_ACTION_NONE
  *         @arg @ref LL_I3C_RESET_ACTION_PARTIAL
  *         @arg @ref LL_I3C_RESET_ACTION_FULL
  */
__STATIC_INLINE uint32_t LL_I3C_GetResetAction(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->DEVR0, I3C_DEVR0_RSTACT));
}

/**
  * @brief  Request a control word FIFO Flush.
  * @rmtoll
  *  CFGR      CFLUSH        LL_I3C_RequestControlFIFOFlush
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_RequestControlFIFOFlush(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_CFLUSH);
}

/**
  * @brief  Request a combined flush of selected FIFOs (TX / RX / Status / Control).
  * @rmtoll
  *  CFGR      TXFLUSH        LL_I3C_RequestFifosFlush\n
  *  CFGR      RXFLUSH        LL_I3C_RequestFifosFlush\n
  *  CFGR      SFLUSH         LL_I3C_RequestFifosFlush\n
  *  CFGR      CFLUSH         LL_I3C_RequestFifosFlush
  * @param  p_i3c I3C instance.
  * @param  flush_mask this parameter is a combination of the following values:
  *         I3C_CFGR_TXFLUSH (TX FIFO)
  *         I3C_CFGR_RXFLUSH (RX FIFO)
  *         I3C_CFGR_SFLUSH  (Status FIFO)
  *         I3C_CFGR_CFLUSH  (Control FIFO)
  * @note   Each bit is auto cleared by hardware after the flush completes.
  */
__STATIC_INLINE void LL_I3C_RequestFifosFlush(I3C_TypeDef *p_i3c, uint32_t flush_mask)
{
  STM32_SET_BIT(p_i3c->CFGR, flush_mask);
}

/**
  * @brief  Request a Transfer start.
  * @rmtoll
  *  CFGR      TSFSET        LL_I3C_RequestTransfer
  * @param  p_i3c I3C Instance.
  * @note   After request, the current instruction in control Register is executed on I3C Bus.
  */
__STATIC_INLINE void LL_I3C_RequestTransfer(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->CFGR, I3C_CFGR_TSFSET);
}

/**
  * @brief  Handles I3C message content on the I3C Bus as controller.
  * @rmtoll
  *  CR           ADD           LL_I3C_ControllerHandleMessage \n
  *  CR           DCNT          LL_I3C_ControllerHandleMessage \n
  *  CR           RNW           LL_I3C_ControllerHandleMessage \n
  *  CR           MTYPE         LL_I3C_ControllerHandleMessage \n
  *  CR           MEND          LL_I3C_ControllerHandleMessage
  * @param  p_i3c I3C Instance.
  * @param  tgt_addr Specifies the target address to be programmed.
  *               This parameter must be a value between Min_Data=0 and Max_Data=0xFF.
  * @param  xfer_size Specifies the number of bytes to be programmed.
  *               This parameter must be a value between Min_Data=0 and Max_Data=65535.
  * @param  direction This parameter can be one of the following values:
  *         @arg @ref LL_I3C_DIRECTION_WRITE
  *         @arg @ref LL_I3C_DIRECTION_READ
  * @param  msg_type This parameter can be one of the following values:
  *         @arg @ref LL_I3C_CONTROLLER_MTYPE_RELEASE
  *         @arg @ref LL_I3C_CONTROLLER_MTYPE_HEADER
  *         @arg @ref LL_I3C_CONTROLLER_MTYPE_PRIVATE
  *         @arg @ref LL_I3C_CONTROLLER_MTYPE_DIRECT
  *         @arg @ref LL_I3C_CONTROLLER_MTYPE_LEGACY_I2C
  * @param  end_mode This parameter can be one of the following values:
  *         @arg @ref LL_I3C_GENERATE_STOP
  *         @arg @ref LL_I3C_GENERATE_RESTART
  */
__STATIC_INLINE void LL_I3C_ControllerHandleMessage(I3C_TypeDef *p_i3c, uint32_t tgt_addr, uint32_t xfer_size,
                                                    uint32_t direction, uint32_t msg_type, uint32_t end_mode)
{
  STM32_WRITE_REG(p_i3c->CR, ((tgt_addr << I3C_CR_ADD_Pos) | xfer_size | direction | msg_type | end_mode) \
                  & (I3C_CR_ADD | I3C_CR_DCNT | I3C_CR_RNW | I3C_CR_MTYPE | I3C_CR_MEND));
}

/**
  * @brief  Issue a header message followed by STOP (no data, no address field).
  * @rmtoll
  *  CR           MTYPE        LL_I3C_ControllerHeaderStop \n
  *  CR           MEND         LL_I3C_ControllerHeaderStop
  * @param  p_i3c I3C Instance.
  * @note   Only header (7'h7E arbitration) then STOP. Use when control FIFO disabled and
  *         a pure header cycle is required (e.g. bus idle insertion).
  */
__STATIC_INLINE void LL_I3C_ControllerHeaderStop(I3C_TypeDef *p_i3c)
{
  LL_I3C_WRITE_REG(p_i3c, CR, (LL_I3C_CONTROLLER_MTYPE_HEADER | LL_I3C_GENERATE_STOP) & (I3C_CR_MTYPE | I3C_CR_MEND));
}

/**
  * @brief  Issue a RELEASE message followed by STOP (no data, no address field).
  * @rmtoll
  *  CR           MTYPE        LL_I3C_ControllerReleaseStop \n
  *  CR           MEND         LL_I3C_ControllerReleaseStop
  * @param  p_i3c I3C Instance.
  * @note   RELEASE stops SCL until next instruction; then STOP is generated.
  */
__STATIC_INLINE void LL_I3C_ControllerReleaseStop(I3C_TypeDef *p_i3c)
{
  LL_I3C_WRITE_REG(p_i3c, CR, (LL_I3C_CONTROLLER_MTYPE_RELEASE | LL_I3C_GENERATE_STOP) & (I3C_CR_MTYPE | I3C_CR_MEND));
}

/**
  * @brief  Handles I3C Common command Code content on the I3C Bus as controller.
  * @rmtoll
  *  CR           CCC           LL_I3C_ControllerHandleCCC \n
  *  CR           DCNT          LL_I3C_ControllerHandleCCC \n
  *  CR           MTYPE         LL_I3C_ControllerHandleCCC \n
  *  CR           MEND          LL_I3C_ControllerHandleCCC
  * @param  p_i3c I3C Instance.
  * @param  ccc_value Specifies the command Code to be programmed.
  *               This parameter must be a value between Min_Data=0 and Max_Data=0x1FF.
  * @param  add_byte_size Specifies the number of CCC additional bytes to be programmed.
  *               This parameter must be a value between Min_Data=0 and Max_Data=65535.
  * @param  end_mode This parameter can be one of the following values:
  *         @arg @ref LL_I3C_GENERATE_STOP
  *         @arg @ref LL_I3C_GENERATE_RESTART
  */
__STATIC_INLINE void LL_I3C_ControllerHandleCCC(I3C_TypeDef *p_i3c, uint32_t ccc_value,
                                                uint32_t add_byte_size, uint32_t end_mode)
{
  STM32_WRITE_REG(p_i3c->CR, ((ccc_value << I3C_CR_CCC_Pos) | add_byte_size | end_mode | LL_I3C_CONTROLLER_MTYPE_CCC) \
                  & (I3C_CR_CCC | I3C_CR_DCNT | I3C_CR_MTYPE | I3C_CR_MEND));
}

/**
  * @brief  Handles I3C message content on the I3C Bus as target.
  * @rmtoll
  *  CR           MTYPE         LL_I3C_TargetHandleMessage \n
  *  CR           DCNT          LL_I3C_TargetHandleMessage
  * @param  p_i3c I3C Instance.
  * @param  msg_type This parameter can be one of the following values:
  *         @arg @ref LL_I3C_TARGET_MTYPE_HOT_JOIN
  *         @arg @ref LL_I3C_TARGET_MTYPE_CONTROLLER_ROLE_REQ
  *         @arg @ref LL_I3C_TARGET_MTYPE_IBI
  * @param  ibi_size_byte Specifies the number of IBI bytes.
  *               This parameter must be a value between Min_Data=0 and Max_Data=65535.
  */
__STATIC_INLINE void LL_I3C_TargetHandleMessage(I3C_TypeDef *p_i3c, uint32_t msg_type, uint32_t ibi_size_byte)
{
  STM32_WRITE_REG(p_i3c->CR, (msg_type | ibi_size_byte) & (I3C_CR_DCNT | I3C_CR_MTYPE));
}

/**
  * @}
  */

/** @defgroup I3C_LL_EF_Data_Management Data_Management
  * @{
  */

/**
  * @brief  Read receive data byte register.
  * @rmtoll
  *  RDR          RDB0         LL_I3C_ReceiveData8
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 to Max_Data=0xFF
  */
__STATIC_INLINE uint8_t LL_I3C_ReceiveData8(const I3C_TypeDef *p_i3c)
{
  return (uint8_t)(STM32_READ_BIT(p_i3c->RDR, I3C_RDR_RDB0));
}

/**
  * @brief  Write in transmit data byte Register.
  * @rmtoll
  *  TDR          TDB0         LL_I3C_TransmitData8
  * @param  p_i3c I3C Instance.
  * @param  data This parameter must be a value between Min_Data=0 and Max_Data=0xFF.
  */
__STATIC_INLINE void LL_I3C_TransmitData8(I3C_TypeDef *p_i3c, uint8_t data)
{
  STM32_WRITE_REG(p_i3c->TDR, data);
}

/**
  * @brief  Read receive data word register.
  * @rmtoll
  *  RDWR         RDWR          LL_I3C_ReceiveData32
  * @param  p_i3c I3C Instance.
  * @note   Content of register is filled in Little Endian.
  *         The MSB corresponds to the last data byte received,
  *         LSB corresponds to first data byte received.
  * @retval Value between Min_Data=0 to Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_I3C_ReceiveData32(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_REG(p_i3c->RDWR));
}

/**
  * @brief  Write in transmit data word register.
  * @rmtoll
  *  TDWR         TDWR          LL_I3C_TransmitData32
  * @param  p_i3c I3C Instance.
  * @param  data This parameter must be a value between Min_Data=0 and Max_Data=0xFFFFFFFF.
  * @note   Content of register is filled in Little Endian.
  *         The MSB corresponds to the last data byte transmitted,
  *         LSB corresponds to first data byte transmitted.
  */
__STATIC_INLINE void LL_I3C_TransmitData32(I3C_TypeDef *p_i3c, uint32_t data)
{
  STM32_WRITE_REG(p_i3c->TDWR, data);
}

/**
  * @brief  Write a single control word to CR.
  * @rmtoll       CR           LL_I3C_WriteControlWord
  * @param  p_i3c I3C Instance.
  * @param  control_word 32-bit control word (ADD/DCNT/RNW/MTYPE/MEND bits as needed).
  * @note   Use when control FIFO (TMODE) is disabled and one instruction must be issued.
  */
__STATIC_INLINE void LL_I3C_WriteControlWord(I3C_TypeDef *p_i3c, uint32_t control_word)
{
  STM32_WRITE_REG(p_i3c->CR, control_word);
}

/**
  * @brief  Configure the IBI data payload to be sent during IBI (target mode).
  * @rmtoll
  *  IBIDR        IBIDR         LL_I3C_SetIBIPayload
  * @param  p_i3c I3C Instance.
  * @param  own_ibi_payload This parameter must be a value between Min_Data=0 and Max_Data=0xFFFFFFFF
  * @note   Content of register is filled in Little Endian.
  *         Mean MSB corresponds to last IBI data byte,
  *         LSB corresponds to first IBI data byte.
  */
__STATIC_INLINE void LL_I3C_SetIBIPayload(I3C_TypeDef *p_i3c, uint32_t own_ibi_payload)
{
  STM32_WRITE_REG(p_i3c->IBIDR, own_ibi_payload);
}

