MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i3c.h
/**
  * @brief  Get the own IBI data payload (target mode), or get the target IBI received (controller mode).
  * @rmtoll
  *  IBIDR        IBIDR         LL_I3C_GetIBIPayload
  * @param  p_i3c I3C Instance.
  * @note   Content of register is filled in Little Endian.
  *         Mean MSB corresponds to last IBI data byte,
  *         LSB corresponds to first IBI data byte.
  * @retval Value between Min_Data=0 to Max_Data=0xFFFFFFFF
  */
__STATIC_INLINE uint32_t LL_I3C_GetIBIPayload(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_REG(p_i3c->IBIDR));
}

/**
  * @brief  Get the number of data bytes received when reading IBI data (controller mode).
  * @rmtoll
  *  RMR         IBIRDCNT     LL_I3C_GetNbIBIAddData
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 to Max_Data=0x7
  */
__STATIC_INLINE uint32_t LL_I3C_GetNbIBIAddData(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->RMR, I3C_RMR_IBIRDCNT));
}

/**
  * @brief  Get the target address received during accepted IBI or controller-role request.
  * @rmtoll
  *  RMR         RADD         LL_I3C_GetIBITargetAddr
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 to Max_Data=0x3F
  */
__STATIC_INLINE uint32_t LL_I3C_GetIBITargetAddr(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->RMR, I3C_RMR_RADD) >> I3C_RMR_RADD_Pos);
}

/**
  * @brief  Set TX FIFO Preload (target mode).
  * @rmtoll
  *  TGTTDR       PRELOAD       LL_I3C_ConfigTxPreload \n
  *  TGTTDR       TDCNT         LL_I3C_ConfigTxPreload
  * @param  p_i3c I3C Instance.
  * @param  tx_data_count This parameter must be a value between Min_Data=0 and Max_Data=0xFFFF
  * @note   Set high by Software, cleared by hardware when all the bytes to transmit have been loaded to TX FIFO.
  */
__STATIC_INLINE void LL_I3C_ConfigTxPreload(I3C_TypeDef *p_i3c, uint16_t tx_data_count)
{
  STM32_MODIFY_REG(p_i3c->TGTTDR, (I3C_TGTTDR_PRELOAD | I3C_TGTTDR_TGTTDCNT), (I3C_TGTTDR_PRELOAD | tx_data_count));
}

/**
  * @brief  Indicates the status of TX FIFO preload (target mode).
  *         RESET: no preload of TX FIFO.
  *         SET: preload of TX FIFO ongoing.
  * @rmtoll
  *  TGTTDR       PRELOAD       LL_I3C_IsActiveTxPreload
  * @param  p_i3c I3C Instance.
  * @note   Set high by Software, cleared by hardware when all the bytes to transmit have been loaded to TX FIFO.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveTxPreload(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->TGTTDR, I3C_TGTTDR_PRELOAD) == (I3C_TGTTDR_PRELOAD)) ? 1UL : 0UL);
}

/**
  * @brief  Get the number of bytes to transmit (target mode).
  * @rmtoll
  *  TGTTDR       TDCNT        LL_I3C_GetTxPreloadDataCount
  * @param  p_i3c I3C Instance.
  * @note   The return value corresponds to the remaining number of bytes to load in TX FIFO.
  * @retval Value between Min_Data=0 to Max_Data=0xFFFF
  */
__STATIC_INLINE uint16_t LL_I3C_GetTxPreloadDataCount(const I3C_TypeDef *p_i3c)
{
  return (uint16_t)(STM32_READ_BIT(p_i3c->TGTTDR, I3C_TGTTDR_TGTTDCNT));
}

/**
  * @brief  Get the number of data during a transfer.
  * @rmtoll
  *  SR           XDCNT      LL_I3C_GetXferDataCount
  * @param  p_i3c I3C Instance.
  * @note   The return value corresponds to number of transmitted bytes reported
  *         during Address Assignment process in target mode.
  * The return value  corresponds to number of target detected
  * during address Assignment process in controller mode.
  * The return value  corresponds to number of data bytes read from or sent to the I3C bus
  * during the message link to MID current value.
  * @retval Value between Min_Data=0 to Max_Data=0xFFFF
  */
__STATIC_INLINE uint32_t LL_I3C_GetXferDataCount(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->SR, I3C_SR_XDCNT));
}

/**
  * @brief  Indicates if a target abort a private read command.
  * @rmtoll
  *  SR           ABT           LL_I3C_IsTargetAbortPrivateRead
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsTargetAbortPrivateRead(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->SR, I3C_SR_ABT) == (I3C_SR_ABT)) ? 1UL : 0UL);
}

/**
  * @brief  Get direction of the message.
  * @rmtoll
  *  SR           DIR           LL_I3C_GetMessageDirection
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_MESSAGE_DIRECTION_WRITE
  *         @arg @ref LL_I3C_MESSAGE_DIRECTION_READ
  */
__STATIC_INLINE uint32_t LL_I3C_GetMessageDirection(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->SR, I3C_SR_DIR));
}

/**
  * @brief  Get message identifier.
  * @rmtoll
  *  SR           MID           LL_I3C_GetMessageIdentifier
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 to Max_Data=0xFF, representing the internal hardware counter value.
  */
__STATIC_INLINE uint32_t LL_I3C_GetMessageIdentifier(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->SR, I3C_SR_MID) >> I3C_SR_MID_Pos);
}

/**
  * @brief  Get message error code.
  * @rmtoll
  *  SER          CODERR        LL_I3C_GetMessageErrorCode
  * @param  p_i3c I3C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I3C_CONTROLLER_ERROR_CE0
  *         @arg @ref LL_I3C_CONTROLLER_ERROR_CE1
  *         @arg @ref LL_I3C_CONTROLLER_ERROR_CE2
  *         @arg @ref LL_I3C_CONTROLLER_ERROR_CE3
  *         @arg @ref LL_I3C_TARGET_ERROR_TE0
  *         @arg @ref LL_I3C_TARGET_ERROR_TE1
  *         @arg @ref LL_I3C_TARGET_ERROR_TE2
  *         @arg @ref LL_I3C_TARGET_ERROR_TE3
  *         @arg @ref LL_I3C_TARGET_ERROR_TE4
  *         @arg @ref LL_I3C_TARGET_ERROR_TE5
  *         @arg @ref LL_I3C_TARGET_ERROR_TE6
  */
__STATIC_INLINE uint32_t LL_I3C_GetMessageErrorCode(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->SER, I3C_SER_CODERR));
}

/**
  * @brief  Get CCC code of received command.
  * @rmtoll
  *  RMR         RCODE        LL_I3C_GetReceiveCommandCode
  * @param  p_i3c I3C Instance.
  * @retval Value between Min_Data=0 to Max_Data=0xFF.
  */
__STATIC_INLINE uint32_t LL_I3C_GetReceiveCommandCode(const I3C_TypeDef *p_i3c)
{
  return (uint32_t)(STM32_READ_BIT(p_i3c->RMR, I3C_RMR_RCODE) >> I3C_RMR_RCODE_Pos);
}

/**
  * @}
  */

/** @defgroup I3C_LL_EF_Target Payload
  * @{
  */

/**
  * @brief  Set dynamic address assigned to target x.
  * @rmtoll
  *  DEVRX        DA            LL_I3C_SetTargetDynamicAddress
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  * @param  dynamic_addr Value between Min_Data=0 to Max_Data=0x7F
  */
__STATIC_INLINE void LL_I3C_SetTargetDynamicAddress(I3C_TypeDef *p_i3c, uint32_t target_id, uint32_t dynamic_addr)
{
  STM32_MODIFY_REG(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_DA, (dynamic_addr << I3C_DEVRX_DA_Pos));
}

/**
  * @brief  Get dynamic address assigned to target x.
  * @rmtoll
  *  DEVRX        DA            LL_I3C_GetTargetDynamicAddress
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  * @retval Value between Min_Data=0 to Max_Data=0x7F
  */
__STATIC_INLINE uint32_t LL_I3C_GetTargetDynamicAddress(const I3C_TypeDef *p_i3c, uint32_t target_id)
{
  return (uint32_t)((STM32_READ_BIT(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_DA)) >> I3C_DEVRX_DA_Pos);
}

/**
  * @brief  Enable IBI acknowledgement from target x(controller mode).
  * @rmtoll
  *  DEVRX        IBIACK        LL_I3C_EnableTargetIBIAck
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  * @note   The bit DIS is automatically set when CRACK or IBIACK are set.
  *         This means DEVRX register access is not allowed.
  *         Reset CRACK and IBIACK will reset DIS bit.
  */
__STATIC_INLINE void LL_I3C_EnableTargetIBIAck(I3C_TypeDef *p_i3c, uint32_t target_id)
{
  STM32_SET_BIT(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_IBIACK);
}

/**
  * @brief  Disable IBI acknowledgement from target x (controller mode).
  * @rmtoll
  *  DEVRX        IBIACK        LL_I3C_DisableTargetIBIAck
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  */
__STATIC_INLINE void LL_I3C_DisableTargetIBIAck(I3C_TypeDef *p_i3c, uint32_t target_id)
{
  STM32_CLEAR_BIT(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_IBIACK);
}

/**
  * @brief  Indicates if IBI from target x will be Acknowledged or not Acknowledged (controller mode).
  *         RESET: IBI not Acknowledged.
  *         SET: IBI Acknowledged.
  * @rmtoll
  *  DEVRX        IBIACK        LL_I3C_IsEnabledTargetIBIAck
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledTargetIBIAck(const I3C_TypeDef *p_i3c, uint32_t target_id)
{
  return ((STM32_READ_BIT(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_IBIACK) == I3C_DEVRX_IBIACK) ? 1UL : 0UL);
}

/**
  * @brief  Enable controller-role request acknowledgement from target x(controller mode).
  * @rmtoll
  *  DEVRX        CRACK         LL_I3C_EnableTargetCRAck
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  * @note   The bit DIS is automatically set when CRACK or IBIACK are set.
  *         This means DEVRX register access is not allowed.
  *         Reset CRACK and IBIACK will reset DIS bit.
  */
__STATIC_INLINE void LL_I3C_EnableTargetCRAck(I3C_TypeDef *p_i3c, uint32_t target_id)
{
  STM32_SET_BIT(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_CRACK);
}

/**
  * @brief  Disable controller-role request acknowledgement from target x (controller mode).
  * @rmtoll
  *  DEVRX        CRACK         LL_I3C_DisableTargetCRAck
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  */
__STATIC_INLINE void LL_I3C_DisableTargetCRAck(I3C_TypeDef *p_i3c, uint32_t target_id)
{
  STM32_CLEAR_BIT(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_CRACK);
}

/**
  * @brief  Indicates if controller-role request from target x will be
  *         Acknowledged or not Acknowledged (controller mode).
  *         RESET: controller-role request not Acknowledged.
  *         SET: controller-role request Acknowledged.
  * @rmtoll
  *  DEVRX        CRACK         LL_I3C_IsEnabledTargetCRAck
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledTargetCRAck(const I3C_TypeDef *p_i3c, uint32_t target_id)
{
  return ((STM32_READ_BIT(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_CRACK) == I3C_DEVRX_CRACK) ? 1UL : 0UL);
}

/**
  * @brief  Enable additional Mandatory data Byte (MDB) follows the accepted IBI from target x.
  * @rmtoll
  *  DEVRX        IBIDEN          LL_I3C_EnableIBIAddData
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  */
__STATIC_INLINE void LL_I3C_EnableIBIAddData(I3C_TypeDef *p_i3c, uint32_t target_id)
{
  STM32_SET_BIT(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_IBIDEN);
}

/**
  * @brief  Disable additional Mandatory data Byte (MDB) follows the accepted IBI from target x.
  * @rmtoll
  *  DEVRX        IBIDEN          LL_I3C_DisableIBIAddData
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  */
__STATIC_INLINE void LL_I3C_DisableIBIAddData(I3C_TypeDef *p_i3c, uint32_t target_id)
{
  STM32_CLEAR_BIT(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_IBIDEN);
}

/**
  * @brief  Indicates if additional Mandatory data Byte (MDB) follows the accepted IBI from target x.
  *         RESET: no Mandatory data Byte follows IBI.
  *         SET: mandatory data Byte follows IBI.
  * @rmtoll
  *  DEVRX        IBIDEN          LL_I3C_IsEnabledIBIAddData
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIBIAddData(const I3C_TypeDef *p_i3c, uint32_t target_id)
{
  return ((STM32_READ_BIT(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_IBIDEN) == I3C_DEVRX_IBIDEN) ? 1UL : 0UL);
}

/**
  * @brief  Enable Suspension of Current transfer during IBI treatment.
  * @rmtoll
  *  DEVRX        SUSP          LL_I3C_EnableFrameSuspend
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  * @note   When set, this feature will allow controller to send a stop condition and CR FIFO is flushed after
  *         IBI treatment.
  *         Software has to rewrite instructions in control Register to start a new transfer.
  */
__STATIC_INLINE void LL_I3C_EnableFrameSuspend(I3C_TypeDef *p_i3c, uint32_t target_id)
{
  STM32_SET_BIT(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_SUSP);
}

/**
  * @brief  Disable Suspension of Current transfer during IBI treatment.
  * @rmtoll
  *  DEVRX        SUSP          LL_I3C_DisableFrameSuspend
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  * @note   When set, this feature will allow controller to continue CR FIFO treatment after IBI treatment.
  */
__STATIC_INLINE void LL_I3C_DisableFrameSuspend(I3C_TypeDef *p_i3c, uint32_t target_id)
{
  STM32_CLEAR_BIT(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_SUSP);
}

/**
  * @brief  Indicates if I3C transfer must be Suspended or not Suspended during IBI treatment from target x.
  *         RESET: transfer is not suspended. Instruction in CR FIFO are executed after IBI.
  *         SET: transfer is suspended (a stop condition is sent). CR FIFO is flushed.
  * @rmtoll
  *  DEVRX        SUSP          LL_I3C_IsFrameMustBeSuspended
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsFrameMustBeSuspended(const I3C_TypeDef *p_i3c, uint32_t target_id)
{
  return ((STM32_READ_BIT(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_SUSP) == I3C_DEVRX_SUSP) ? 1UL : 0UL);
}

/**
  * @brief  Indicates if update of the device Characteristics Register is Allowed or not Allowed.
  *         RESET: device Characteristics Register update is not Allowed.
  *         SET: device Characteristics Register update is Allowed.
  * @rmtoll
  *  DEVRX        DIS           LL_I3C_IsAllowedPayloadUpdate
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  * @note   Used to prevent software writing during reception of an IBI or controller-role request from target x.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsAllowedPayloadUpdate(const I3C_TypeDef *p_i3c, uint32_t target_id)
{
  return ((STM32_READ_BIT(p_i3c->DEVRX[target_id - 1U], I3C_DEVRX_DIS) != I3C_DEVRX_DIS) ? 1UL : 0UL);
}

/**
  * @brief  Set I3C bus devices configuration.
  * @rmtoll
  *  DEVRX        DA            LL_I3C_ConfigDeviceCapabilities \n
  *  DEVRX        IBIACK        LL_I3C_ConfigDeviceCapabilities \n
  *  DEVRX        IBIDEN        LL_I3C_ConfigDeviceCapabilities \n
  *  DEVRX        CRACK         LL_I3C_ConfigDeviceCapabilities
  * @param  p_i3c I3C Instance.
  * @param  target_id This parameter must be a value between Min_Data=1 and Max_Data=4
  * @param  dynamic_addr Value between Min_Data=0 to Max_Data=0x7F
  * @param  IBIAck Value This parameter can be one of the following values:
  *         @arg @ref LL_I3C_IBI_CAPABILITY
  *         @arg @ref LL_I3C_IBI_NO_CAPABILITY
  * @param  IBIAddData This parameter can be one of the following values:
  *         @arg @ref LL_I3C_IBI_DATA_ENABLE
  *         @arg @ref LL_I3C_IBI_DATA_DISABLE
  * @param  CRAck This parameter can be one of the following values:
  *         @arg @ref LL_I3C_CR_CAPABILITY
  *         @arg @ref LL_I3C_CR_NO_CAPABILITY
  * @note   This function is called only when the I3C instance is initialized as controller.
  *         This function can be called by the controller application to help the automatic treatment when target have
  *         capability of IBI and/or control-Role.
  */
__STATIC_INLINE void LL_I3C_ConfigDeviceCapabilities(I3C_TypeDef *p_i3c,
                                                     uint32_t target_id,
                                                     uint32_t dynamic_addr,
                                                     uint32_t IBIAck,
                                                     uint32_t IBIAddData,
                                                     uint32_t CRAck)
{
  STM32_MODIFY_REG(p_i3c->DEVRX[target_id - 1U], \
                   (I3C_DEVRX_DA | I3C_DEVRX_IBIACK | I3C_DEVRX_CRACK | I3C_DEVRX_IBIDEN), \
                   ((dynamic_addr << I3C_DEVRX_DA_Pos) | IBIAck | IBIAddData | CRAck));
}

/**
  * @brief  Set DEVRx.
  * @rmtoll
  *  DEVRX        DA            LL_I3C_SetDevrx \n
  *  DEVRX        IBIACK        LL_I3C_SetDevrx \n
  *  DEVRX        IBIDEN        LL_I3C_SetDevrx \n
  *  DEVRX        SUSP          LL_I3C_SetDevrx \n
  *  DEVRX        CRACK         LL_I3C_SetDevrx
  * @param  p_i3c I3C Instance.
  * @param  devrx_index This parameter must be a value between Min_Data=0 and Max_Data=4
  * @param  dynamic_addr Value between Min_Data=0 to Max_Data=0x7F
  * @param  IBIAck Value This parameter can be one of the following values:
  *         @arg @ref LL_I3C_IBI_CAPABILITY
  *         @arg @ref LL_I3C_IBI_NO_CAPABILITY
   * @param  Susp This parameter can be one of the following values:
   *         @arg @ref LL_I3C_SUSP_ENABLE
   *         @arg @ref LL_I3C_SUSP_DISABLE
  * @param  IBIAddData This parameter can be one of the following values:
  *         @arg @ref LL_I3C_IBI_DATA_ENABLE
  *         @arg @ref LL_I3C_IBI_DATA_DISABLE
   * @param  CRAck This parameter can be one of the following values:
  *         @arg @ref LL_I3C_CR_CAPABILITY
  *         @arg @ref LL_I3C_CR_NO_CAPABILITY
  * @note   This function is called only when the I3C instance is initialized as controller.
  *         This function can be called by the controller application to help the automatic treatment when target have
  *         capability of IBI and/or control-Role.
  */
__STATIC_INLINE void LL_I3C_SetDevrx(I3C_TypeDef *p_i3c,
                                     uint32_t devrx_index,
                                     uint32_t dynamic_addr,
                                     uint32_t IBIAck,
                                     uint32_t Susp,
                                     uint32_t IBIAddData,
                                     uint32_t CRAck)
{
  STM32_WRITE_REG(p_i3c->DEVRX[devrx_index], ((dynamic_addr << I3C_DEVRX_DA_Pos) | IBIAck | Susp | IBIAddData | CRAck));
}

/**
  * @brief  Get DEVRx raw register value.
  * @rmtoll
  *  DEVRX        DA            LL_I3C_GetDevrx \n
  *  DEVRX        IBIACK        LL_I3C_GetDevrx \n
  *  DEVRX        IBIDEN        LL_I3C_GetDevrx \n
  *  DEVRX        SUSP          LL_I3C_GetDevrx \n
  *  DEVRX        CRACK         LL_I3C_GetDevrx
  * @param  p_i3c I3C Instance.
  * @param  devrx_index This parameter must be a value between Min_Data=0 and Max_Data=4
  * @retval Raw 32-bit value of DEVRX[devrx_index].
  */
__STATIC_INLINE uint32_t LL_I3C_GetDevrx(const I3C_TypeDef *p_i3c, uint32_t devrx_index)
{
  return (uint32_t)STM32_READ_REG(p_i3c->DEVRX[devrx_index]);
}

/**
  * @}
  */

/** @defgroup I3C_LL_EF_FLAG_management FLAG_management
  * @{
  */

/**
  * @brief  Check if one of the flags is active.
  * @rmtoll EVR <flag> LL_I3C_IsActiveFlag
  * @param  p_i3c I3C Instance.
  * @param  flags  I3C_LL_EC_GET_FLAG.
  * @retval 0 no flag is set
  * @retval 1 at least one of the flags is set
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag(const I3C_TypeDef *p_i3c, uint32_t flags)
{
  return ((STM32_READ_BIT(p_i3c->EVR, (flags)) != 0U) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of control FIFO empty flag.
  *         RESET: one or more data are available in control FIFO.
  *         SET: no more data available in control FIFO.
  * @rmtoll
  *  EVR          CFEF          LL_I3C_IsActiveFlag_CFE
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_CFE(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_CFEF) == (I3C_EVR_CFEF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of transmit FIFO empty flag.
  *         RESET: one or more data are available in transmit FIFO.
  *         SET: no more data available in transmit FIFO.
  * @rmtoll
  *  EVR          TXFEF         LL_I3C_IsActiveFlag_TXFE
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_TXFE(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_TXFEF) == (I3C_EVR_TXFEF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of control FIFO not full flag.
  *         RESET: one or more free space available in control FIFO.
  *         SET: no more free space available in control FIFO.
  * @rmtoll
  *  EVR          CFNFF         LL_I3C_IsActiveFlag_CFNF
  * @param  p_i3c I3C Instance.
  * @note   When a transfer is ongoing, the control FIFO must not be written unless this flag is set.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_CFNF(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_CFNFF) == (I3C_EVR_CFNFF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of status FIFO not empty flag.
  *         RESET: one or more free space available in status FIFO.
  *         SET: no more free space available in status FIFO.
  * @rmtoll
  *  EVR          SFNEF         LL_I3C_IsActiveFlag_SFNE
  * @param  p_i3c I3C Instance.
  * @note   This flag is updated only when the FIFO is used, mean SMODE = 1.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_SFNE(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_SFNEF) == (I3C_EVR_SFNEF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of transmit FIFO not full flag.
  *         RESET: one or more free space available in transmit FIFO.
  *         SET: no more free space available in transmit FIFO.
  * @rmtoll
  *  EVR          TXFNFF        LL_I3C_IsActiveFlag_TXFNF
  * @param  p_i3c I3C Instance.
  * @note   When a transfer is ongoing, the transmit FIFO must not be written unless this flag is set.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_TXFNF(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_TXFNFF) == (I3C_EVR_TXFNFF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of receive FIFO not full flag.
  *         RESET: one or more data are available in receive FIFO.
  *         SET: no more data available in receive FIFO.
  * @rmtoll
  *  EVR          RXFNEF        LL_I3C_IsActiveFlag_RXFNE
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_RXFNE(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_RXFNEF) == (I3C_EVR_RXFNEF)) ? 1UL : 0UL);
}

