MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i3c.h
/**
  * @brief  Indicates that the last receive byte is available.
  *         RESET: clear default value.
  *         SET: last receive byte ready to read from receive FIFO.
  * @rmtoll
  *  EVR          RXLASTF       LL_I3C_IsActiveFlag_RXLAST
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_RXLAST(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_RXLASTF) == (I3C_EVR_RXLASTF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates that the last transmit byte is written in FIFO.
  *         RESET: transmission is not finalized.
  *         SET: last transmit byte is written in transmit FIFO.
  * @rmtoll
  *  EVR          TXLASTF       LL_I3C_IsActiveFlag_TXLAST
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_TXLAST(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_TXLASTF) == (I3C_EVR_TXLASTF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of Frame Complete flag (controller and target mode).
  *         RESET: current Frame transfer is not finalized.
  *         SET: current Frame transfer is completed.
  * @rmtoll
  *  EVR          FCF           LL_I3C_IsActiveFlag_FC
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_FC(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_FCF) == (I3C_EVR_FCF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of reception target end flag (controller mode).
  *         RESET: clear default value.
  *         SET: target prematurely ended a read command.
  * @rmtoll
  *  EVR          RXTGTENDF     LL_I3C_IsActiveFlag_RXTGTEND
  * @param  p_i3c I3C Instance.
  * @note   This flag is set only when status FIFO is not used, mean SMODE = 0.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_RXTGTEND(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_RXTGTENDF) == (I3C_EVR_RXTGTENDF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of error flag (controller and target mode).
  *         RESET: clear default value.
  *         SET: One or more Errors are detected.
  * @rmtoll
  *  EVR          ERRF          LL_I3C_IsActiveFlag_ERR
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_ERR(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_ERRF) == (I3C_EVR_ERRF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of IBI flag (controller mode).
  *         RESET: clear default value.
  *         SET: An IBI has been received.
  * @rmtoll
  *  EVR          IBIF          LL_I3C_IsActiveFlag_IBI
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_IBI(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_IBIF) == (I3C_EVR_IBIF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of IBI end flag (target mode).
  *         RESET: clear default value.
  *         SET: IBI procedure is finished.
  * @rmtoll
  *  EVR          IBIENDF       LL_I3C_IsActiveFlag_IBIEND
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_IBIEND(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_IBIENDF) == (I3C_EVR_IBIENDF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of controller-role request flag (controller mode).
  *         RESET: clear default value.
  *         SET: a controller-role request procedure has been received.
  * @rmtoll
  *  EVR          CRF           LL_I3C_IsActiveFlag_CR
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_CR(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_CRF) == (I3C_EVR_CRF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of controller-role request update flag (target mode).
  *         RESET: clear default value.
  *         SET: I3C device has gained controller-role of the I3C Bus.
  * @rmtoll
  *  EVR          BCUPDF        LL_I3C_IsActiveFlag_CRUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_CRUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_CRUPDF) == (I3C_EVR_CRUPDF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of Hot-Join flag (controller mode).
  *         RESET: clear default value.
  *         SET: a Hot-Join request has been received.
  * @rmtoll
  *  EVR          HJF           LL_I3C_IsActiveFlag_HJ
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_HJ(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_HJF) == (I3C_EVR_HJF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of wakeup flag (target mode).
  *         RESET: clear default value.
  *         SET: I3C Internal clock not available on time to treat the falling edge on SCL.
  * @rmtoll
  *  EVR          WKPF          LL_I3C_IsActiveFlag_WKP
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_WKP(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_WKPF) == (I3C_EVR_WKPF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of get flag (target mode).
  *         RESET: clear default value.
  *         SET: a "get" type CCC has been received.
  * @rmtoll
  *  EVR          GETF          LL_I3C_IsActiveFlag_GET
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_GET(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_GETF) == (I3C_EVR_GETF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of get status flag (target mode).
  *         RESET: clear default value.
  *         SET: a GETSTATUS command has been received.
  * @rmtoll
  *  EVR          STAF          LL_I3C_IsActiveFlag_STA
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_STA(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_STAF) == (I3C_EVR_STAF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of dynamic address update flag (target mode).
  *         RESET: clear default value.
  *         SET: own dynamic address has been updated.
  * @rmtoll
  *  EVR          DAUPDF        LL_I3C_IsActiveFlag_DAUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_DAUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_DAUPDF) == (I3C_EVR_DAUPDF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of max write length flag (target mode).
  *         RESET: clear default value.
  *         SET: max write length has been updated.
  * @rmtoll
  *  EVR          MWLUPDF       LL_I3C_IsActiveFlag_MWLUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_MWLUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_MWLUPDF) == (I3C_EVR_MWLUPDF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of max read length flag (target mode).
  *         RESET: clear default value.
  *         SET: max read length has been updated.
  * @rmtoll
  *  EVR          MRLUPDF       LL_I3C_IsActiveFlag_MRLUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_MRLUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_MRLUPDF) == (I3C_EVR_MRLUPDF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of reset flag (target mode).
  *         RESET: clear default value.
  *         SET: a reset pattern has been received.
  * @rmtoll
  *  EVR          RSTF          LL_I3C_IsActiveFlag_RST
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_RST(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_RSTF) == (I3C_EVR_RSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of active state flag (target mode).
  *         RESET: clear default value.
  *         SET: the activity state has been updated.
  * @rmtoll
  *  EVR          ASUPDF        LL_I3C_IsActiveFlag_ASUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_ASUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_ASUPDF) == (I3C_EVR_ASUPDF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of interrupt update flag (target mode).
  *         RESET: clear default value.
  *         SET: One or more authorized interrupts have been updated.
  * @rmtoll
  *  EVR          INTUPDF       LL_I3C_IsActiveFlag_INTUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_INTUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_INTUPDF) == (I3C_EVR_INTUPDF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of define list targets flag (target mode).
  *         RESET: clear default value.
  *         SET: a define list targets command has been received.
  * @rmtoll
  *  EVR          DEFF          LL_I3C_IsActiveFlag_DEF
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_DEF(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_DEFF) == (I3C_EVR_DEFF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of define list Group addresses flag.
  *         RESET: clear default value.
  *         SET: define list Group addresses have been received.
  * @rmtoll
  *  EVR          GRPF          LL_I3C_IsActiveFlag_GRP
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_GRP(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->EVR, I3C_EVR_GRPF) == (I3C_EVR_GRPF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of Protocol error flag.
  *         RESET: clear default value.
  *         SET: protocol error detected.
  * @rmtoll
  *  SER          PERR          LL_I3C_IsActiveFlag_PERR
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_PERR(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->SER, I3C_SER_PERR) == (I3C_SER_PERR)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of SCL Stall error flag (target mode).
  *         RESET: clear default value.
  *         SET: target detected that SCL was stable for more than 125us during I3C SDR read.
  * @rmtoll
  *  SER          STALL         LL_I3C_IsActiveFlag_STALL
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_STALL(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->SER, I3C_SER_STALL) == (I3C_SER_STALL)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of RX or TX FIFO Overrun flag.
  *         RESET: clear default value.
  *         SET: RX FIFO full or TX FIFO empty depending of direction of message.
  * @rmtoll
  *  SER          DOVR          LL_I3C_IsActiveFlag_DOVR
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_DOVR(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->SER, I3C_SER_DOVR) == (I3C_SER_DOVR)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of control or status FIFO Overrun flag (controller mode).
  *         RESET: clear default value.
  *         SET: status FIFO full or control FIFO empty after Restart.
  * @rmtoll
  *  SER          COVR          LL_I3C_IsActiveFlag_COVR
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_COVR(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->SER, I3C_SER_COVR) == (I3C_SER_COVR)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of address not acknowledged flag (controller mode).
  *         RESET: clear default value.
  *         SET: controller detected that target NACKed static or dynamic address.
  * @rmtoll
  *  SER          ANACK         LL_I3C_IsActiveFlag_ANACK
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_ANACK(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->SER, I3C_SER_ANACK) == (I3C_SER_ANACK)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of data not acknowledged flag (controller mode).
  *         RESET: clear default value.
  *         SET: controller detected that target NACKed data byte.
  * @rmtoll
  *  SER          DNACK         LL_I3C_IsActiveFlag_DNACK
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_DNACK(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->SER, I3C_SER_DNACK) == (I3C_SER_DNACK)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of data error flag (controller mode).
  *         RESET: clear default value.
  *         SET: controller detected data error during controller-role handoff process.
  * @rmtoll
  *  SER          DERR          LL_I3C_IsActiveFlag_DERR
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveFlag_DERR(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->SER, I3C_SER_DERR) == (I3C_SER_DERR)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup I3C_LL_EF_IT_Management IT_Management
  * @{
  */


/**
  * @brief  Enable the specified I3C interrupts.
  * @rmtoll
  *  IER  CFNFIE     LL_I3C_EnableIT  \n
  *  IER  SFNEIE     LL_I3C_EnableIT  \n
  *  IER  TXFNFIE    LL_I3C_EnableIT  \n
  *  IER  RXFNEIE    LL_I3C_EnableIT  \n
  *  IER  FCIE       LL_I3C_EnableIT  \n
  *  IER  RXTGTENDIE LL_I3C_EnableIT  \n
  *  IER  ERRIE      LL_I3C_EnableIT  \n
  *  IER  IBIIE      LL_I3C_EnableIT  \n
  *  IER  IBIENDIE   LL_I3C_EnableIT  \n
  *  IER  CRIE       LL_I3C_EnableIT  \n
  *  IER  CRUPDIE    LL_I3C_EnableIT  \n
  *  IER  HJIE       LL_I3C_EnableIT  \n
  *  IER  WKPIE      LL_I3C_EnableIT  \n
  *  IER  GETIE      LL_I3C_EnableIT  \n
  *  IER  STAIE      LL_I3C_EnableIT  \n
  *  IER  DAUPDIE    LL_I3C_EnableIT  \n
  *  IER  MWLUPDIE   LL_I3C_EnableIT  \n
  *  IER  MRLUPDIE   LL_I3C_EnableIT  \n
  *  IER  RSTIE      LL_I3C_EnableIT  \n
  *  IER  ASUPDIE    LL_I3C_EnableIT  \n
  *  IER  INTUPDIE   LL_I3C_EnableIT  \n
  *  IER  DEFIE      LL_I3C_EnableIT  \n
  *  IER  GRPIE      LL_I3C_EnableIT
  * @param  p_i3c I3C instance.
  * @param  mask interrupt sources to enable.
  *         This parameter can be a combination of the following values:
  *            @arg @ref LL_I3C_IER_CFNFIE
  *            @arg @ref LL_I3C_IER_SFNEIE
  *            @arg @ref LL_I3C_IER_TXFNFIE
  *            @arg @ref LL_I3C_IER_RXFNEIE
  *            @arg @ref LL_I3C_IER_FCIE
  *            @arg @ref LL_I3C_IER_RXTGTENDIE
  *            @arg @ref LL_I3C_IER_ERRIE
  *            @arg @ref LL_I3C_IER_IBIIE
  *            @arg @ref LL_I3C_IER_IBIENDIE
  *            @arg @ref LL_I3C_IER_CRIE
  *            @arg @ref LL_I3C_IER_CRUPDIE
  *            @arg @ref LL_I3C_IER_HJIE
  *            @arg @ref LL_I3C_IER_WKPIE
  *            @arg @ref LL_I3C_IER_GETIE
  *            @arg @ref LL_I3C_IER_STAIE
  *            @arg @ref LL_I3C_IER_DAUPDIE
  *            @arg @ref LL_I3C_IER_MWLUPDIE
  *            @arg @ref LL_I3C_IER_MRLUPDIE
  *            @arg @ref LL_I3C_IER_RSTIE
  *            @arg @ref LL_I3C_IER_ASUPDIE
  *            @arg @ref LL_I3C_IER_INTUPDIE
  *            @arg @ref LL_I3C_IER_DEFIE
  *            @arg @ref LL_I3C_IER_GRPIE
  */
__STATIC_INLINE void LL_I3C_EnableIT(I3C_TypeDef *p_i3c, uint32_t mask)
{
  STM32_SET_BIT(p_i3c->IER, mask);
}

/**
  * @brief  Disable the specified I3C interrupts.
  * @rmtoll
  *  IER  CFNFIE     LL_I3C_DisableIT  \n
  *  IER  SFNEIE     LL_I3C_DisableIT  \n
  *  IER  TXFNFIE    LL_I3C_DisableIT  \n
  *  IER  RXFNEIE    LL_I3C_DisableIT  \n
  *  IER  FCIE       LL_I3C_DisableIT  \n
  *  IER  RXTGTENDIE LL_I3C_DisableIT  \n
  *  IER  ERRIE      LL_I3C_DisableIT  \n
  *  IER  IBIIE      LL_I3C_DisableIT  \n
  *  IER  IBIENDIE   LL_I3C_DisableIT  \n
  *  IER  CRIE       LL_I3C_DisableIT  \n
  *  IER  CRUPDIE    LL_I3C_DisableIT  \n
  *  IER  HJIE       LL_I3C_DisableIT  \n
  *  IER  WKPIE      LL_I3C_DisableIT  \n
  *  IER  GETIE      LL_I3C_DisableIT  \n
  *  IER  STAIE      LL_I3C_DisableIT  \n
  *  IER  DAUPDIE    LL_I3C_DisableIT  \n
  *  IER  MWLUPDIE   LL_I3C_DisableIT  \n
  *  IER  MRLUPDIE   LL_I3C_DisableIT  \n
  *  IER  RSTIE      LL_I3C_DisableIT  \n
  *  IER  ASUPDIE    LL_I3C_DisableIT  \n
  *  IER  INTUPDIE   LL_I3C_DisableIT  \n
  *  IER  DEFIE      LL_I3C_DisableIT  \n
  *  IER  GRPIE      LL_I3C_DisableIT
  * @param  p_i3c I3C instance.
  * @param  mask interrupt sources to disable.
  *         This parameter can be a combination of the following values:
  *            @arg @ref LL_I3C_IER_CFNFIE
  *            @arg @ref LL_I3C_IER_SFNEIE
  *            @arg @ref LL_I3C_IER_TXFNFIE
  *            @arg @ref LL_I3C_IER_RXFNEIE
  *            @arg @ref LL_I3C_IER_FCIE
  *            @arg @ref LL_I3C_IER_RXTGTENDIE
  *            @arg @ref LL_I3C_IER_ERRIE
  *            @arg @ref LL_I3C_IER_IBIIE
  *            @arg @ref LL_I3C_IER_IBIENDIE
  *            @arg @ref LL_I3C_IER_CRIE
  *            @arg @ref LL_I3C_IER_CRUPDIE
  *            @arg @ref LL_I3C_IER_HJIE
  *            @arg @ref LL_I3C_IER_WKPIE
  *            @arg @ref LL_I3C_IER_GETIE
  *            @arg @ref LL_I3C_IER_STAIE
  *            @arg @ref LL_I3C_IER_DAUPDIE
  *            @arg @ref LL_I3C_IER_MWLUPDIE
  *            @arg @ref LL_I3C_IER_MRLUPDIE
  *            @arg @ref LL_I3C_IER_RSTIE
  *            @arg @ref LL_I3C_IER_ASUPDIE
  *            @arg @ref LL_I3C_IER_INTUPDIE
  *            @arg @ref LL_I3C_IER_DEFIE
  *            @arg @ref LL_I3C_IER_GRPIE
  */
__STATIC_INLINE void LL_I3C_DisableIT(I3C_TypeDef *p_i3c, uint32_t mask)
{
  STM32_CLEAR_BIT(p_i3c->IER, mask);
}

/**
  * @brief  Check whether the specified I3C interrupts sources are enabled or not.
  * @rmtoll
  *  IER  CFNFIE     LL_I3C_IsEnabledIT  \n
  *  IER  SFNEIE     LL_I3C_IsEnabledIT  \n
  *  IER  TXFNFIE    LL_I3C_IsEnabledIT  \n
  *  IER  RXFNEIE    LL_I3C_IsEnabledIT  \n
  *  IER  FCIE       LL_I3C_IsEnabledIT  \n
  *  IER  RXTGTENDIE LL_I3C_IsEnabledIT  \n
  *  IER  ERRIE      LL_I3C_IsEnabledIT  \n
  *  IER  IBIIE      LL_I3C_IsEnabledIT  \n
  *  IER  IBIENDIE   LL_I3C_IsEnabledIT  \n
  *  IER  CRIE       LL_I3C_IsEnabledIT  \n
  *  IER  CRUPDIE    LL_I3C_IsEnabledIT  \n
  *  IER  HJIE       LL_I3C_IsEnabledIT  \n
  *  IER  WKPIE      LL_I3C_IsEnabledIT  \n
  *  IER  GETIE      LL_I3C_IsEnabledIT  \n
  *  IER  STAIE      LL_I3C_IsEnabledIT  \n
  *  IER  DAUPDIE    LL_I3C_IsEnabledIT  \n
  *  IER  MWLUPDIE   LL_I3C_IsEnabledIT  \n
  *  IER  MRLUPDIE   LL_I3C_IsEnabledIT  \n
  *  IER  RSTIE      LL_I3C_IsEnabledIT  \n
  *  IER  ASUPDIE    LL_I3C_IsEnabledIT  \n
  *  IER  INTUPDIE   LL_I3C_IsEnabledIT  \n
  *  IER  DEFIE      LL_I3C_IsEnabledIT  \n
  *  IER  GRPIE      LL_I3C_IsEnabledIT
  * @param  p_i3c I3C instance.
  * @param  mask Interrupts sources to check.
  *         This parameter can be a combination of the following values:
  *            @arg @ref LL_I3C_IER_CFNFIE
  *            @arg @ref LL_I3C_IER_SFNEIE
  *            @arg @ref LL_I3C_IER_TXFNFIE
  *            @arg @ref LL_I3C_IER_RXFNEIE
  *            @arg @ref LL_I3C_IER_FCIE
  *            @arg @ref LL_I3C_IER_RXTGTENDIE
  *            @arg @ref LL_I3C_IER_ERRIE
  *            @arg @ref LL_I3C_IER_IBIIE
  *            @arg @ref LL_I3C_IER_IBIENDIE
  *            @arg @ref LL_I3C_IER_CRIE
  *            @arg @ref LL_I3C_IER_CRUPDIE
  *            @arg @ref LL_I3C_IER_HJIE
  *            @arg @ref LL_I3C_IER_WKPIE
  *            @arg @ref LL_I3C_IER_GETIE
  *            @arg @ref LL_I3C_IER_STAIE
  *            @arg @ref LL_I3C_IER_DAUPDIE
  *            @arg @ref LL_I3C_IER_MWLUPDIE
  *            @arg @ref LL_I3C_IER_MRLUPDIE
  *            @arg @ref LL_I3C_IER_RSTIE
  *            @arg @ref LL_I3C_IER_ASUPDIE
  *            @arg @ref LL_I3C_IER_INTUPDIE
  *            @arg @ref LL_I3C_IER_DEFIE
  *            @arg @ref LL_I3C_IER_GRPIE
  *            @arg @ref LL_I3C_IER_ALL
  * @retval State of interrupts sources (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT(const I3C_TypeDef *p_i3c, uint32_t mask)
{
  return ((STM32_READ_BIT(p_i3c->IER, mask) == (mask)) ? 1UL : 0UL);
}

/**
  * @brief  Enable control FIFO not full interrupt.
  * @rmtoll
  *  IER          CFNFIE        LL_I3C_EnableIT_CFNF
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_CFNF(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_CFNFIE);
}

/**
  * @brief  Disable control FIFO not full interrupt.
  * @rmtoll
  *  IER          CFNFIE        LL_I3C_DisableIT_CFNF
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_CFNF(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_CFNFIE);
}

/**
  * @brief  Check if control FIFO not full interrupt is enabled or disabled.
  * @rmtoll
  *  IER          CFNFIE        LL_I3C_IsEnabledIT_CFNF
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_CFNF(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_CFNFIE) == (I3C_IER_CFNFIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable status FIFO not empty interrupt.
  * @rmtoll
  *  IER          SFNEIE        LL_I3C_EnableIT_SFNE
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_SFNE(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_SFNEIE);
}

/**
  * @brief  Disable status FIFO not empty interrupt.
  * @rmtoll
  *  IER          SFNEIE        LL_I3C_DisableIT_SFNE
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_SFNE(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_SFNEIE);
}

/**
  * @brief  Check if status FIFO not empty interrupt is enabled or disabled.
  * @rmtoll
  *  IER          SFNEIE        LL_I3C_IsEnabledIT_SFNE
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_SFNE(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_SFNEIE) == (I3C_IER_SFNEIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable transmit FIFO not full interrupt.
  * @rmtoll
  *  IER          TXFNFIE       LL_I3C_EnableIT_TXFNF
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_TXFNF(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_TXFNFIE);
}

/**
  * @brief  Disable transmit FIFO not full interrupt.
  * @rmtoll
  *  IER          TXFNFIE       LL_I3C_DisableIT_TXFNF
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_TXFNF(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_TXFNFIE);
}

/**
  * @brief  Check if transmit FIFO not full interrupt is enabled or disabled.
  * @rmtoll
  *  IER          TXFNFIE       LL_I3C_IsEnabledIT_TXFNF
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_TXFNF(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_TXFNFIE) == (I3C_IER_TXFNFIE)) ? 1UL : 0UL);
}

