MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i3c.h
/**
  * @brief  Enable receive FIFO not empty interrupt.
  * @rmtoll
  *  IER          RXFNEIE       LL_I3C_EnableIT_RXFNE
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_RXFNE(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_RXFNEIE);
}

/**
  * @brief  Disable receive FIFO not empty interrupt.
  * @rmtoll
  *  IER          RXFNEIE       LL_I3C_DisableIT_RXFNE
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_RXFNE(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_RXFNEIE);
}

/**
  * @brief  Check if receive FIFO not empty interrupt is enabled or disabled.
  * @rmtoll
  *  IER          RXFNEIE       LL_I3C_IsEnabledIT_RXFNE
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_RXFNE(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_RXFNEIE) == (I3C_IER_RXFNEIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Frame Complete interrupt.
  * @rmtoll
  *  IER          FCIE          LL_I3C_EnableIT_FC
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_FC(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_FCIE);
}

/**
  * @brief  Disable Frame Complete interrupt.
  * @rmtoll
  *  IER          FCIE          LL_I3C_DisableIT_FC
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_FC(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_FCIE);
}

/**
  * @brief  Check if Frame Complete interrupt is enabled or disabled.
  * @rmtoll
  *  IER          FCIE          LL_I3C_IsEnabledIT_FC
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_FC(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_FCIE) == (I3C_IER_FCIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable reception target End interrupt.
  * @rmtoll
  *  IER          RXTGTENDIE    LL_I3C_EnableIT_RXTGTEND
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_RXTGTEND(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_RXTGTENDIE);
}

/**
  * @brief  Disable reception target End interrupt.
  * @rmtoll
  *  IER          RXTGTENDIE    LL_I3C_DisableIT_RXTGTEND
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_RXTGTEND(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_RXTGTENDIE);
}

/**
  * @brief  Check if reception target End interrupt is enabled or disabled.
  * @rmtoll
  *  IER          RXTGTENDIE    LL_I3C_IsEnabledIT_RXTGTEND
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_RXTGTEND(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_RXTGTENDIE) == (I3C_IER_RXTGTENDIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable error interrupt.
  * @rmtoll
  *  IER          ERRIE         LL_I3C_EnableIT_ERR
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_ERR(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_ERRIE);
}

/**
  * @brief  Disable error interrupt.
  * @rmtoll
  *  IER          ERRIE         LL_I3C_DisableIT_ERR
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_ERR(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_ERRIE);
}

/**
  * @brief  Check if error interrupt is enabled or disabled.
  * @rmtoll
  *  IER          ERRIE         LL_I3C_IsEnabledIT_ERR
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_ERR(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_ERRIE) == (I3C_IER_ERRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable IBI interrupt.
  * @rmtoll
  *  IER          IBIIE         LL_I3C_EnableIT_IBI
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_IBI(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_IBIIE);
}

/**
  * @brief  Disable IBI interrupt.
  * @rmtoll
  *  IER          IBIIE         LL_I3C_DisableIT_IBI
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_IBI(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_IBIIE);
}

/**
  * @brief  Check if IBI interrupt is enabled or disabled.
  * @rmtoll
  *  IER          IBIIE         LL_I3C_IsEnabledIT_IBI
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_IBI(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_IBIIE) == (I3C_IER_IBIIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable IBI End interrupt.
  * @rmtoll
  *  IER          IBIENDIE      LL_I3C_EnableIT_IBIEND
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_IBIEND(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_IBIENDIE);
}

/**
  * @brief  Disable IBI End interrupt.
  * @rmtoll
  *  IER          IBIENDIE      LL_I3C_DisableIT_IBIEND
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_IBIEND(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_IBIENDIE);
}

/**
  * @brief  Check if IBI End interrupt is enabled or disabled.
  * @rmtoll
  *  IER          IBIENDIE      LL_I3C_IsEnabledIT_IBIEND
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_IBIEND(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_IBIENDIE) == (I3C_IER_IBIENDIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable controller-role interrupt.
  * @rmtoll
  *  IER          CRIE          LL_I3C_EnableIT_CR
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_CR(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_CRIE);
}

/**
  * @brief  Disable controller-role interrupt.
  * @rmtoll
  *  IER          CRIE          LL_I3C_DisableIT_CR
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_CR(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_CRIE);
}

/**
  * @brief  Check if controller-role interrupt is enabled or disabled.
  * @rmtoll
  *  IER          CRIE          LL_I3C_IsEnabledIT_CR
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_CR(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_CRIE) == (I3C_IER_CRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable controller-role update interrupt.
  * @rmtoll
  *  IER          CRUPDIE       LL_I3C_EnableIT_CRUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_CRUPD(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_CRUPDIE);
}

/**
  * @brief  Disable controller-role update interrupt.
  * @rmtoll
  *  IER          CRUPDIE       LL_I3C_DisableIT_CRUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_CRUPD(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_CRUPDIE);
}

/**
  * @brief  Check if controller-role update interrupt is enabled or disabled.
  * @rmtoll
  *  IER          CRUPDIE       LL_I3C_IsEnabledIT_CRUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_CRUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_CRUPDIE) == (I3C_IER_CRUPDIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Hot-Join interrupt.
  * @rmtoll
  *  IER          HJIE          LL_I3C_EnableIT_HJ
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_HJ(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_HJIE);
}

/**
  * @brief  Disable Hot-Join interrupt.
  * @rmtoll
  *  IER          HJIE          LL_I3C_DisableIT_HJ
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_HJ(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_HJIE);
}

/**
  * @brief  Check if Hot-Join interrupt is enabled or disabled.
  * @rmtoll
  *  IER          HJIE          LL_I3C_IsEnabledIT_HJ
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_HJ(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_HJIE) == (I3C_IER_HJIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable wake up interrupt.
  * @rmtoll
  *  IER          WKPIE         LL_I3C_EnableIT_WKP
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_WKP(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_WKPIE);
}

/**
  * @brief  Disable wake up interrupt.
  * @rmtoll
  *  IER          WKPIE         LL_I3C_DisableIT_WKP
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_WKP(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_WKPIE);
}

/**
  * @brief  Check if wakeup is enabled or disabled.
  * @rmtoll
  *  IER          WKPIE         LL_I3C_IsEnabledIT_WKP
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_WKP(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_WKPIE) == (I3C_IER_WKPIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable get command interrupt.
  * @rmtoll
  *  IER          GETIE         LL_I3C_EnableIT_GET
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_GET(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_GETIE);
}

/**
  * @brief  Disable get command interrupt.
  * @rmtoll
  *  IER          GETIE         LL_I3C_DisableIT_GET
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_GET(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_GETIE);
}

/**
  * @brief  Check if get command is enabled or disabled.
  * @rmtoll
  *  IER          GETIE         LL_I3C_IsEnabledIT_GET
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_GET(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_GETIE) == (I3C_IER_GETIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable get status interrupt.
  * @rmtoll
  *  IER          STAIE         LL_I3C_EnableIT_STA
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_STA(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_STAIE);
}

/**
  * @brief  Disable get status interrupt.
  * @rmtoll
  *  IER          STAIE         LL_I3C_DisableIT_STA
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_STA(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_STAIE);
}

/**
  * @brief  Check if get status interrupt is enabled or disabled.
  * @rmtoll
  *  IER          STAIE         LL_I3C_IsEnabledIT_STA
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_STA(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_STAIE) == (I3C_IER_STAIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable dynamic address update interrupt.
  * @rmtoll
  *  IER          DAUPDIE       LL_I3C_EnableIT_DAUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_DAUPD(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_DAUPDIE);
}

/**
  * @brief  Disable dynamic address update interrupt.
  * @rmtoll
  *  IER          DAUPDIE       LL_I3C_DisableIT_DAUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_DAUPD(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_DAUPDIE);
}

/**
  * @brief  Check if dynamic address update interrupt is enabled or disabled.
  * @rmtoll
  *  IER          DAUPDIE       LL_I3C_IsEnabledIT_DAUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_DAUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_DAUPDIE) == (I3C_IER_DAUPDIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable max write length update interrupt.
  * @rmtoll
  *  IER          MWLUPDIE      LL_I3C_EnableIT_MWLUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_MWLUPD(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_MWLUPDIE);
}

/**
  * @brief  Disable max write length update interrupt.
  * @rmtoll
  *  IER          MWLUPDIE      LL_I3C_DisableIT_MWLUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_MWLUPD(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_MWLUPDIE);
}

/**
  * @brief  Check if max write length update interrupt is enabled or disabled.
  * @rmtoll
  *  IER          MWLUPDIE      LL_I3C_IsEnabledIT_MWLUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_MWLUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_MWLUPDIE) == (I3C_IER_MWLUPDIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable max read length update interrupt.
  * @rmtoll
  *  IER          MRLUPDIE      LL_I3C_EnableIT_MRLUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_MRLUPD(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_MRLUPDIE);
}

/**
  * @brief  Disable max read length update interrupt.
  * @rmtoll
  *  IER          MRLUPDIE      LL_I3C_DisableIT_MRLUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_MRLUPD(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_MRLUPDIE);
}

/**
  * @brief  Check if max read length update interrupt is enabled or disabled.
  * @rmtoll
  *  IER          MRLUPDIE      LL_I3C_IsEnabledIT_MRLUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_MRLUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_MRLUPDIE) == (I3C_IER_MRLUPDIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable reset interrupt.
  * @rmtoll
  *  IER          RSTIE         LL_I3C_EnableIT_RST
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_RST(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_RSTIE);
}

/**
  * @brief  Disable reset interrupt.
  * @rmtoll
  *  IER          RSTIE         LL_I3C_DisableIT_RST
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_RST(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_RSTIE);
}

/**
  * @brief  Check if reset interrupt is enabled or disabled.
  * @rmtoll
  *  IER          RSTIE         LL_I3C_IsEnabledIT_RST
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_RST(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_RSTIE) == (I3C_IER_RSTIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable activity state update interrupt.
  * @rmtoll
  *  IER          ASUPDIE       LL_I3C_EnableIT_ASUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_ASUPD(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_ASUPDIE);
}

/**
  * @brief  Disable activity state update interrupt.
  * @rmtoll
  *  IER          ASUPDIE       LL_I3C_DisableIT_ASUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_ASUPD(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_ASUPDIE);
}

/**
  * @brief  Check if activity state update interrupt is enabled or disabled.
  * @rmtoll
  *  IER          ASUPDIE       LL_I3C_IsEnabledIT_ASUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_ASUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_ASUPDIE) == (I3C_IER_ASUPDIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable interrupt update interrupt.
  * @rmtoll
  *  IER          INTUPDIE      LL_I3C_EnableIT_INTUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_INTUPD(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_INTUPDIE);
}

/**
  * @brief  Disable interrupt update interrupt.
  * @rmtoll
  *  IER          INTUPDIE      LL_I3C_DisableIT_INTUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_INTUPD(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_INTUPDIE);
}

/**
  * @brief  Check if interrupt update interrupt is enabled or disabled.
  * @rmtoll
  *  IER          INTUPDIE      LL_I3C_IsEnabledIT_INTUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_INTUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_INTUPDIE) == (I3C_IER_INTUPDIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable define list target interrupt.
  * @rmtoll
  *  IER          DEFIE         LL_I3C_EnableIT_DEF
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_DEF(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_DEFIE);
}

/**
  * @brief  Disable define list target interrupt.
  * @rmtoll
  *  IER          DEFIE         LL_I3C_DisableIT_DEF
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_DEF(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_DEFIE);
}

/**
  * @brief  Check if define list target interrupt is enabled or disabled.
  * @rmtoll
  *  IER          DEFIE         LL_I3C_IsEnabledIT_DEF
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_DEF(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_DEFIE) == (I3C_IER_DEFIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable define list Group addresses interrupt.
  * @rmtoll
  *  IER          GRPIE         LL_I3C_EnableIT_GRP
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_EnableIT_GRP(I3C_TypeDef *p_i3c)
{
  STM32_SET_BIT(p_i3c->IER, I3C_IER_GRPIE);
}

/**
  * @brief  Disable define list Group addresses interrupt.
  * @rmtoll
  *  IER          GRPIE         LL_I3C_DisableIT_GRP
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_DisableIT_GRP(I3C_TypeDef *p_i3c)
{
  STM32_CLEAR_BIT(p_i3c->IER, I3C_IER_GRPIE);
}

/**
  * @brief  Check if define list Group addresses interrupt is enabled or disabled.
  * @rmtoll
  *  IER          GRPIE         LL_I3C_IsEnabledIT_GRP
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsEnabledIT_GRP(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->IER, I3C_IER_GRPIE) == (I3C_IER_GRPIE)) ? 1UL : 0UL);
}

/**
  * @}
  */

