MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i3c.h
/** @addtogroup I3C_LL_EF_FLAG_management FLAG_management
  * @{
  */

/**
  * @brief  Clear Frame Complete flag (controller and target mode).
  * @rmtoll
  *  CEVR         CFCF          LL_I3C_ClearFlag_FC
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_FC(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CFCF);
}

/**
  * @brief  Clear reception target end flag (controller mode).
  * @rmtoll
  *  CEVR         CRXTGTENDF    LL_I3C_ClearFlag_RXTGTEND
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_RXTGTEND(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CRXTGTENDF);
}

/**
  * @brief  Clear error flag (controller and target mode).
  * @rmtoll
  *  CEVR         CERRF         LL_I3C_ClearFlag_ERR
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_ERR(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CERRF);
}

/**
  * @brief  Clear IBI flag (controller mode).
  * @rmtoll
  *  CEVR         CIBIF         LL_I3C_ClearFlag_IBI
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_IBI(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CIBIF);
}

/**
  * @brief  Clear IBI end flag (target mode).
  * @rmtoll
  *  CEVR         CIBIENDF      LL_I3C_ClearFlag_IBIEND
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_IBIEND(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CIBIENDF);
}

/**
  * @brief  Clear controller-role request flag (controller mode).
  * @rmtoll
  *  CEVR         CCRF          LL_I3C_ClearFlag_CR
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_CR(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CCRF);
}

/**
  * @brief  Clear controller-role request update flag (target mode).
  * @rmtoll
  *  CEVR         CCRUPDF       LL_I3C_ClearFlag_CRUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_CRUPD(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CCRUPDF);
}

/**
  * @brief  Clear Hot-Join flag (controller mode).
  * @rmtoll
  *  CEVR         CHJF          LL_I3C_ClearFlag_HJ
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_HJ(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CHJF);
}

/**
  * @brief  Clear wakeup flag (target mode).
  * @rmtoll
  *  CEVR         CWKPF         LL_I3C_ClearFlag_WKP
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_WKP(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CWKPF);
}

/**
  * @brief  Clear get flag (target mode).
  * @rmtoll
  *  CEVR         CGETF         LL_I3C_ClearFlag_GET
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_GET(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CGETF);
}

/**
  * @brief  Clear get status flag (target mode).
  * @rmtoll
  *  CEVR         CSTAF         LL_I3C_ClearFlag_STA
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_STA(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CSTAF);
}

/**
  * @brief  Clear dynamic address update flag (target mode).
  * @rmtoll
  *  CEVR         CDAUPDF       LL_I3C_ClearFlag_DAUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_DAUPD(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CDAUPDF);
}

/**
  * @brief  Clear max write length flag (target mode).
  * @rmtoll
  *  CEVR         CMWLUPDF      LL_I3C_ClearFlag_MWLUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_MWLUPD(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CMWLUPDF);
}

/**
  * @brief  Clear max read length flag (target mode).
  * @rmtoll
  *  CEVR         CMRLUPDF      LL_I3C_ClearFlag_MRLUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_MRLUPD(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CMRLUPDF);
}

/**
  * @brief  Clear reset flag (target mode).
  * @rmtoll
  *  CEVR         CRSTF         LL_I3C_ClearFlag_RST
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_RST(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CRSTF);
}

/**
  * @brief  Clear active state flag (target mode).
  * @rmtoll
  *  CEVR         CASUPDF       LL_I3C_ClearFlag_ASUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_ASUPD(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CASUPDF);
}

/**
  * @brief  Clear interrupt update flag (target mode).
  * @rmtoll
  *  CEVR         CINTUPDF      LL_I3C_ClearFlag_INTUPD
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_INTUPD(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CINTUPDF);
}

/**
  * @brief  Clear define list targets flag (target mode).
  * @rmtoll
  *  CEVR         CDEFF         LL_I3C_ClearFlag_DEF
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_DEF(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CDEFF);
}

/**
  * @brief  Clear define list Group addresses flag.
  * @rmtoll
  *  CEVR         CGRPF         LL_I3C_ClearFlag_GRP
  * @param  p_i3c I3C Instance.
  */
__STATIC_INLINE void LL_I3C_ClearFlag_GRP(I3C_TypeDef *p_i3c)
{
  STM32_WRITE_REG(p_i3c->CEVR, I3C_CEVR_CGRPF);
}

/**
  * @}
  */

/** @defgroup I3C_LL_EF_MASK_IT_Management Mask_IT_Management
  * @{
  */

/**
  * @brief  Indicates the status of masked interrupt control FIFO not full flag.
  * @rmtoll
  *  MISR         CFNFMIS       LL_I3C_IsActiveMaskFlag_CFNF
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_CFNF(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_CFNFMIS) == (I3C_MISR_CFNFMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt status FIFO not empty flag.
  * @rmtoll
  *  MISR         SFNEMIS       LL_I3C_IsActiveMaskFlag_SFNE
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_SFNE(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_SFNEMIS) == (I3C_MISR_SFNEMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt transmit FIFO not full flag.
  * @rmtoll
  *  MISR         TXFNFMIS      LL_I3C_IsActiveMaskFlag_TXFNF
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_TXFNF(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_TXFNFMIS) == (I3C_MISR_TXFNFMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt receive FIFO not empty flag.
  * @rmtoll
  *  MISR         RXFNEMIS      LL_I3C_IsActiveMaskFlag_RXFNE
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_RXFNE(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_RXFNEMIS) == (I3C_MISR_RXFNEMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt Frame Complete flag.
  * @rmtoll
  *  MISR         FCMIS         LL_I3C_IsActiveMaskFlag_FC
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_FC(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_FCMIS) == (I3C_MISR_FCMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt reception target end flag.
  * @rmtoll
  *  MISR         RXTGTENDMIS   LL_I3C_IsActiveMaskFlag_RXTGTEND
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_RXTGTEND(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_RXTGTENDMIS) == (I3C_MISR_RXTGTENDMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt error flag.
  * @rmtoll
  *  MISR         ERRMIS        LL_I3C_IsActiveMaskFlag_ERR
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_ERR(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_ERRMIS) == (I3C_MISR_ERRMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt IBI flag.
  * @rmtoll
  *  MISR         IBIMIS        LL_I3C_IsActiveMaskFlag_IBI
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_IBI(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_IBIMIS) == (I3C_MISR_IBIMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt IBI end flag.
  * @rmtoll
  *  MISR         IBIENDMIS     LL_I3C_IsActiveMaskFlag_IBIEND
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_IBIEND(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_IBIENDMIS) == (I3C_MISR_IBIENDMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt controller-role flag.
  * @rmtoll
  *  MISR         CRMIS         LL_I3C_IsActiveMaskFlag_CR
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_CR(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_CRMIS) == (I3C_MISR_CRMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt controller-role update flag.
  * @rmtoll
  *  MISR         CRUPDMIS      LL_I3C_IsActiveMaskFlag_CRUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_CRUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_CRUPDMIS) == (I3C_MISR_CRUPDMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt Hot-Join flag.
  * @rmtoll
  *  MISR         HJMIS         LL_I3C_IsActiveMaskFlag_HJ
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_HJ(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_HJMIS) == (I3C_MISR_HJMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt wakeup is enabled or disabled.
  * @rmtoll
  *  MISR         WKPMIS        LL_I3C_IsActiveMaskFlag_WKP
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_WKP(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_WKPMIS) == (I3C_MISR_WKPMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt get command is enabled or disabled.
  * @rmtoll
  *  MISR         GETMIS        LL_I3C_IsActiveMaskFlag_GET
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_GET(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_GETMIS) == (I3C_MISR_GETMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt get status flag.
  * @rmtoll
  *  MISR         STAMIS        LL_I3C_IsActiveMaskFlag_STA
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_STA(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_STAMIS) == (I3C_MISR_STAMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt dynamic address update flag.
  * @rmtoll
  *  MISR         DAUPDMIS      LL_I3C_IsActiveMaskFlag_DAUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_DAUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_DAUPDMIS) == (I3C_MISR_DAUPDMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt max write length update flag.
  * @rmtoll
  *  MISR         MWLUPDMIS     LL_I3C_IsActiveMaskFlag_MWLUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_MWLUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_MWLUPDMIS) == (I3C_MISR_MWLUPDMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt max read length update flag.
  * @rmtoll
  *  MISR         MRLUPDMIS     LL_I3C_IsActiveMaskFlag_MRLUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_MRLUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_MRLUPDMIS) == (I3C_MISR_MRLUPDMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt reset flag.
  * @rmtoll
  *  MISR         RSTMIS        LL_I3C_IsActiveMaskFlag_RST
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_RST(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_RSTMIS) == (I3C_MISR_RSTMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt activity state update flag.
  * @rmtoll
  *  MISR         ASUPDMIS      LL_I3C_IsActiveMaskFlag_ASUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_ASUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_ASUPDMIS) == (I3C_MISR_ASUPDMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt update flag.
  * @rmtoll
  *  MISR         INTUPDMIS     LL_I3C_IsActiveMaskFlag_INTUPD
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_INTUPD(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_INTUPDMIS) == (I3C_MISR_INTUPDMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt define list target flag.
  * @rmtoll
  *  MISR         DEFMIS        LL_I3C_IsActiveMaskFlag_DEF
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_DEF(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_DEFMIS) == (I3C_MISR_DEFMIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicates the status of masked interrupt define list Group addresses flag.
  * @rmtoll
  *  MISR         GRPMIS        LL_I3C_IsActiveMaskFlag_GRP
  * @param  p_i3c I3C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I3C_IsActiveMaskFlag_GRP(const I3C_TypeDef *p_i3c)
{
  return ((STM32_READ_BIT(p_i3c->MISR, I3C_MISR_GRPMIS) == (I3C_MISR_GRPMIS)) ? 1UL : 0UL);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* I3C1 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32C5xx_LL_I3C_H */
